htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
/*
	FreeRTOS V9.0.0 - Copyright (C) 2016 Real Time Engineers Ltd.
	All rights reserved
*/

/*
 * Instructions for using this project are provided on:
 * http://www.freertos.org/FreeRTOS-Plus/FreeRTOS_Plus_TCP/examples_FreeRTOS_simulator.html
 */


/* Standard includes. */
#include <stdio.h>
#include <time.h>
#include <ctype.h>

/* FreeRTOS includes. */
#include <FreeRTOS.h>
#include "task.h"
#include "timers.h"
#include "queue.h"
#include "semphr.h"

/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"
#include "FreeRTOS_Sockets.h"
#include "FreeRTOS_DHCP.h"
#include "FreeRTOS_DNS.h"
#include "NetworkBufferManagement.h"
#include "FreeRTOS_ARP.h"
#include "FreeRTOS_IP_Private.h"

#if( ipconfigMULTI_INTERFACE != 0 )
	#include "FreeRTOS_Routing.h"
	#if( ipconfigUSE_IPv6 != 0 )
		#include "FreeRTOS_ND.h"
	#endif
#endif

#include "FreeRTOS_TCP_server.h"
#include "NetworkInterface.h"

#if( USE_PLUS_FAT != 0 )
	/* FreeRTOS+FAT includes. */
	#include "ff_headers.h"
	#include "ff_stdio.h"
	#include "ff_ramdisk.h"
	#include "ff_sddisk.h"
#endif

/* Demo application includes. */
#include "hr_gettime.h"

#include "echo_client.h"

#include "UDPLoggingPrintf.h"

#include "eventLogging.h"

#if( USE_IPERF != 0 )
	#include "iperf_task.h"
#endif


#if( USE_TELNET != 0 )
	#include "telnet.h"
#endif

//#if( ipconfigTCP_IP_SANITY != 0 )
//	#warning ipconfigTCP_IP_SANITY is defined
//#endif

/* ST includes. */
#include "stm32f4xx_hal.h"

#define	mainUDP_SERVER_STACK_SIZE		2048
#define	mainUDP_SERVER_TASK_PRIORITY	2
static void vUDPTest( void *pvParameters );

const char *FreeRTOS_strerror_r( BaseType_t xErrnum, char *pcBuffer, size_t uxLength );

BaseType_t xRandom32( uint32_t *pulValue );

#if( ipconfigMULTI_INTERFACE != 0 )
	static void showEndPoint( NetworkEndPoint_t *pxEndPoint );
#else
	#ifndef ipSIZE_OF_IPv4_ADDRESS
		#define ipSIZE_OF_IPv4_ADDRESS		4
	#endif
	#define FREERTOS_AF_INET4			FREERTOS_AF_INET
#endif

static struct freertos_addrinfo *pxDNSLookup( char *pcHost, BaseType_t xIPVersion, BaseType_t xDoClear );

#include "plus_echo_server.h"

#if( HAS_TCP_TESTER != 0 )
	#include "tcp_tester.h"
#endif

//#include "cmsis_os.h"
/* FTP and HTTP servers execute in the TCP server work task. */
#define mainTCP_SERVER_TASK_PRIORITY	( tskIDLE_PRIORITY + 3 )
#define	mainTCP_SERVER_STACK_SIZE		2048

#define	mainFAT_TEST_STACK_SIZE			2048

#define mainRUN_STDIO_TESTS				0
#define mainHAS_RAMDISK					0
#define mainHAS_SDCARD					1
#define mainSD_CARD_DISK_NAME			"/"
#define mainSD_CARD_TESTING_DIRECTORY	"/fattest"

/* Remove this define if you don't want to include the +FAT test code. */
#define mainHAS_FAT_TEST				USE_PLUS_FAT

/* Set the following constants to 1 to include the relevant server, or 0 to
exclude the relevant server. */
#define mainCREATE_FTP_SERVER			USE_PLUS_FAT
#define mainCREATE_HTTP_SERVER 			USE_PLUS_FAT


/* Define names that will be used for DNS, LLMNR and NBNS searches. */
#define mainHOST_NAME					"stm"
/* http://stm32f4/index.html */
#define mainDEVICE_NICK_NAME			"stm32f4"

int PING_COUNT_MAX = 10;

static void vRegisterDelay();

extern void vApplicationPingReplyHook( ePingReplyStatus_t eStatus, uint16_t usIdentifier );
#if( ipconfigUSE_IPv6 != 0 )
	static IPv6_Address_t xPing6IPAddress;
	volatile BaseType_t xPing6Count = -1;
#endif
uint32_t ulPingIPAddress;
volatile BaseType_t xPing4Count = -1;
volatile BaseType_t xPingReady;
static int pingLogging = pdFALSE;

extern const char *pcApplicationHostnameHook( void );

static SemaphoreHandle_t xServerSemaphore;


/* Private variables ---------------------------------------------------------*/
#ifdef HAL_ADC_MODULE_ENABLED
	ADC_HandleTypeDef hadc3;
#endif

#ifdef HAL_DAC_MODULE_ENABLED
	DAC_HandleTypeDef hdac;
#endif

#ifdef HAL_DCMI_MODULE_ENABLED
	DCMI_HandleTypeDef hdcmi;
#endif

#ifdef HAL_I2C_MODULE_ENABLED
I2C_HandleTypeDef hi2c1;
#endif

#ifdef HAL_RTC_MODULE_ENABLED
RTC_HandleTypeDef hrtc;
#endif

#define USE_USART3_LOGGING 0

#if( USE_USART3_LOGGING )
	UART_HandleTypeDef huart3;
#endif

RNG_HandleTypeDef hrng;

#ifdef HAL_NOR_MODULE_ENABLED
	NOR_HandleTypeDef hnor1;
#endif
SRAM_HandleTypeDef hsram2;
SRAM_HandleTypeDef hsram3;
//osThreadId defaultTaskHandle;

uint8_t retSD;    /* Return value for SD */
char SD_Path[4];  /* SD logical drive path */

int verboseLevel;

typedef enum {
	eIPv4 = 0x01,
	eIPv6 = 0x02,
} eIPVersion;

eIPVersion allowIPVersion = eIPv4 | eIPv6;

#if( USE_PLUS_FAT != 0 )
FF_Disk_t *pxSDDisk;
BaseType_t doMountCard;
BaseType_t cardMounted;
#endif

#if( mainHAS_RAMDISK != 0 )
	static FF_Disk_t *pxRAMDisk;
#endif

#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
static TCPServer_t *pxTCPServer = NULL;
#endif

#ifndef ARRAY_SIZE
#	define	ARRAY_SIZE( x )	( int )( sizeof( x ) / sizeof( x )[ 0 ] )
#endif

/*
 * Just seeds the simple pseudo random number generator.
 */
static void prvSRand( UBaseType_t ulSeed );
uint32_t ulInitialSeed;

/* Private function prototypes -----------------------------------------------*/

/*
 * Creates a RAM disk, then creates files on the RAM disk.  The files can then
 * be viewed via the FTP server and the command line interface.
 */
#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
static void prvCreateDiskAndExampleFiles( void );
#endif

extern void vStdioWithCWDTest( const char *pcMountPath );
extern void vCreateAndVerifyExampleFiles( const char *pcMountPath );

static void checksum_test();

#if( ipconfigUSE_CALLBACKS != 0 )
static BaseType_t xOnUdpReceive( Socket_t xSocket, void * pvData, size_t xLength,
	const struct freertos_sockaddr *pxFrom, const struct freertos_sockaddr *pxDest );
#endif

/*
 * The task that runs the FTP and HTTP servers.
 */
static void prvServerWorkTask( void *pvParameters );

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
#ifdef HAL_ADC_MODULE_ENABLED
	static void MX_ADC3_Init(void);
#endif
#ifdef HAL_DAC_MODULE_ENABLED
	static void MX_DAC_Init(void);
#endif
#ifdef HAL_DCMI_MODULE_ENABLED
	static void MX_DCMI_Init(void);
#endif

static void MX_FSMC_Init(void);

#ifdef HAL_I2C_MODULE_ENABLED
	static void MX_I2C1_Init(void);
#endif

#ifdef HAL_RTC_MODULE_ENABLED
	static void MX_RTC_Init(void);
#endif

