htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
#if( USE_USART3_LOGGING )
	static void MX_USART3_UART_Init(void);
#endif

static void heapInit( void );

void vShowTaskTable( BaseType_t aDoClear );
#if( USE_IPERF != 0 )
	void vIPerfInstall( void );
#endif

/* The default IP and MAC address used by the demo.  The address configuration
defined here will be used if ipconfigUSE_DHCP is 0, or if ipconfigUSE_DHCP is
1 but a DHCP server could not be contacted.  See the online documentation for
more information. */
static const uint8_t ucIPAddress[ 4 ] = { configIP_ADDR0, configIP_ADDR1, configIP_ADDR2, configIP_ADDR3 };
static const uint8_t ucNetMask[ 4 ] = { configNET_MASK0, configNET_MASK1, configNET_MASK2, configNET_MASK3 };
static const uint8_t ucGatewayAddress[ 4 ] = { configGATEWAY_ADDR0, configGATEWAY_ADDR1, configGATEWAY_ADDR2, configGATEWAY_ADDR3 };
static const uint8_t ucDNSServerAddress[ 4 ] = { configDNS_SERVER_ADDR0, configDNS_SERVER_ADDR1, configDNS_SERVER_ADDR2, configDNS_SERVER_ADDR3 };

uint32_t ulServerIPAddress;

/* Default MAC address configuration.  The demo creates a virtual network
connection that uses this MAC address by accessing the raw Ethernet data
to and from a real network connection on the host PC.  See the
configNETWORK_INTERFACE_TO_USE definition for information on how to configure
the real network connection to use. */
#if( ipconfigMULTI_INTERFACE == 0 )
	const uint8_t ucMACAddress[ 6 ] = { configMAC_ADDR0, configMAC_ADDR1, configMAC_ADDR2, configMAC_ADDR3, configMAC_ADDR4, configMAC_ADDR5 };
#else
	static const uint8_t ucMACAddress1[ 6 ] = { configMAC_ADDR0, configMAC_ADDR1, configMAC_ADDR2, configMAC_ADDR3, configMAC_ADDR4, configMAC_ADDR5 };
#endif /* ipconfigMULTI_INTERFACE */

/* Use by the pseudo random number generator. */
static UBaseType_t ulNextRand;

/* Handle of the task that runs the FTP and HTTP servers. */
static TaskHandle_t xServerWorkTaskHandle = NULL;

#if( ipconfigMULTI_INTERFACE != 0 )
	NetworkInterface_t *pxSTM32Fxx_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t *pxInterface );
	NetworkInterface_t *pxLoopback_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t *pxInterface );
#endif /* ipconfigMULTI_INTERFACE */
/*-----------------------------------------------------------*/

#if( ipconfigMULTI_INTERFACE != 0 )
NetworkInterface_t *pxSTMF40_IPInit(
	BaseType_t xEMACIndex, NetworkInterface_t *pxInterface );
#endif

#if( ipconfigMULTI_INTERFACE != 0 )
	static NetworkInterface_t xInterfaces[ 2 ];
	static NetworkEndPoint_t xEndPoints[ 4 ];
#endif /* ipconfigMULTI_INTERFACE */

#define TCP_printf(  )				do {} while( 0 )
#define TCP_debug_printf(  )		do {} while( 0 )

int main( void )
{
uint32_t ulSeed = 0x5a5a5a5a;

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	//SystemClock_Config();

	heapInit( );

#if USE_LOG_EVENT
	iEventLogInit();
	eventLogAdd("Main");
#endif

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
#ifdef HAL_ADC_MODULE_ENABLED
	MX_ADC3_Init();
#endif
#ifdef HAL_DAC_MODULE_ENABLED
	MX_DAC_Init();
#endif
#ifdef HAL_DCMI_MODULE_ENABLED
	MX_DCMI_Init();
#endif
	MX_FSMC_Init();
#ifdef HAL_I2C_MODULE_ENABLED
	MX_I2C1_Init();
#endif
#ifdef HAL_RTC_MODULE_ENABLED
	MX_RTC_Init();
#endif
	#if( USE_USART3_LOGGING )
	{
		MX_USART3_UART_Init();
	}
	#endif

	const int version = 3;
//	TCP_printf( "This beautiful program version %d is started\n", version );

	/* Timer2 initialization function.
	ullGetHighResolutionTime() will be used to get the running time in uS. */
	vStartHighResolutionTimer();

	{
		/* Enable the clock for the RNG. */
		__HAL_RCC_RNG_CLK_ENABLE();
		RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
		RNG->CR |= RNG_CR_RNGEN;

		/* Set the Instance pointer. */
		hrng.Instance = RNG;
		/* Initialise it. */
		HAL_RNG_Init( &hrng );
		/* Get a random number. */
		HAL_RNG_GenerateRandomNumber( &hrng, &ulSeed );
		/* And pass it to the rand() function. */
//		vSRand( ulSeed );
	}

	hrng.Instance = RNG;
	HAL_RNG_Init( &hrng );
	xRandom32( &ulSeed );
	prvSRand( ulSeed );
	ulInitialSeed = ulSeed;

	/* Initialise the network interface.

	***NOTE*** Tasks that use the network are created in the network event hook
	when the network is connected and ready for use (see the definition of
	vApplicationIPNetworkEventHook() below).  The address values passed in here
	are used if ipconfigUSE_DHCP is set to 0, or if ipconfigUSE_DHCP is set to 1
	but a DHCP server cannot be	contacted. */

#if( ipconfigMULTI_INTERFACE == 0 )
	/* Call it later in a task. */
//	FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress );
#else
	pxSTM32Fxx_FillInterfaceDescriptor( 0, &( xInterfaces[0] ) );

	/*
	 * End-point-1  // private + public
	 *     Network: 192.168.2.x/24
	 *     IPv4   : 192.168.2.12
	 *     Gateway: 192.168.2.1 ( NAT router )
	 */
	NetworkEndPoint_t *pxEndPoint_0 = &( xEndPoints[ 0 ] );
	NetworkEndPoint_t *pxEndPoint_1 = &( xEndPoints[ 1 ] );
	NetworkEndPoint_t *pxEndPoint_2 = &( xEndPoints[ 2 ] );
	NetworkEndPoint_t *pxEndPoint_3 = &( xEndPoints[ 3 ] );
	{
		FreeRTOS_FillEndPoint( &( xInterfaces[0] ), pxEndPoint_0, ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress1 );
		#if( ipconfigUSE_DHCP != 0 )
		{
			pxEndPoint_0->bits.bWantDHCP = pdTRUE;
		}
		#endif	/* ( ipconfigUSE_DHCP != 0 ) */
//#warning DHCP disabled

		FreeRTOS_FillEndPoint( &( xInterfaces[0] ), &( xEndPoints[ 3 ] ), ucIPAddress2, ucNetMask2, ucGatewayAddress2, ucDNSServerAddress2, ucMACAddress2 );
	}
	{
		const uint8_t ucIPAddress[] = { 172,  16,   0, 114 };
		const uint8_t ucNetMask[]   = { 255, 255,   0,   0};
		const uint8_t ucGatewayAddress[]   = { 0, 0,   0,   0};
		const uint8_t ucDNSServerAddress[]   = { 0, 0,   0,   0};
		FreeRTOS_FillEndPoint( &( xInterfaces[0] ), pxEndPoint_3, ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress1 );
	}


	#if( ipconfigUSE_IPv6 != 0 )
	{
		/*
		 * End-point-2  // private
		 *     Network: fe80::/10 (link-local)
		 *     IPv6   : fe80::d80e:95cc:3154:b76a/128
		 *     Gateway: -
		*/
		{
			IPv6_Address_t xIPAddress;
			IPv6_Address_t xPrefix;
			// a573:8::5000:0:d8ff:120
			// a8ff:120::593b:200:d8af:20

			FreeRTOS_inet_pton6( "fe80::", xPrefix.ucBytes );
//			FreeRTOS_inet_pton6( "2001:470:ec54::", xPrefix.ucBytes );

