htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
//			Take a random IP-address
//			FreeRTOS_CreateIPv6Address( &xIPAddress, &xPrefix, 64, pdTRUE );

//			Take a fixed IP-address, which is easier for testing.
			//FreeRTOS_inet_pton6( "fe80::b865:6c00:6615:6e50", xIPAddress.ucBytes );
			FreeRTOS_inet_pton6( "fe80::7007", xIPAddress.ucBytes );

			FreeRTOS_FillEndPoint_IPv6( &( xInterfaces[0] ), 
										pxEndPoint_1,
										&( xIPAddress ),
										&( xPrefix ),
										64uL,			/* Prefix length. */
										NULL,			/* No gateway */
										NULL,			/* pxDNSServerAddress: Not used yet. */
										ucMACAddress1 );
		}
		/*
		 * End-point-3  // public
		 *     Network: 2001:470:ec54::/64
		 *     IPv6   : 2001:470:ec54::4514:89d5:4589:8b79/128
		 *     Gateway: fe80::9355:69c7:585a:afe7  // obtained from Router Advertisement
		*/
		{
			IPv6_Address_t xIPAddress;
			IPv6_Address_t xPrefix;
			IPv6_Address_t xGateWay;
			IPv6_Address_t xDNSServer;

			FreeRTOS_inet_pton6( "2001:470:ec54::", xPrefix.ucBytes );
			FreeRTOS_inet_pton6( "2001:4860:4860::8888", xDNSServer.ucBytes );			

			FreeRTOS_CreateIPv6Address( &xIPAddress, &xPrefix, 64, pdTRUE );
			FreeRTOS_inet_pton6( "fe80::9355:69c7:585a:afe7", xGateWay.ucBytes );

			FreeRTOS_FillEndPoint_IPv6( &( xInterfaces[0] ), 
										pxEndPoint_2,
										&( xIPAddress ),
										&( xPrefix ),
										64uL,				/* Prefix length. */
										&( xGateWay ),
										&( xDNSServer ),	/* pxDNSServerAddress: Not used yet. */
										ucMACAddress1 );
			pxEndPoint_2->bits.bWantRA = pdTRUE_UNSIGNED;
		}
	}
	#endif

//	FreeRTOS_IPStart();
#endif /* ipconfigMULTI_INTERFACE */

#if( ipconfigMULTI_INTERFACE == 0 )
	FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress );
#else
	FreeRTOS_IPStart();
#endif
	/* Create the task that handles the FTP and HTTP servers.  This will
	initialise the file system then wait for a notification from the network
	event hook before creating the servers.  The task is created at the idle
	priority, and sets itself to mainTCP_SERVER_TASK_PRIORITY after the file
	system has initialised. */
	xTaskCreate( prvServerWorkTask, "SvrWork", mainTCP_SERVER_STACK_SIZE, NULL, tskIDLE_PRIORITY, &xServerWorkTaskHandle );

	/* Start the RTOS scheduler. */
	FreeRTOS_debug_printf( ("vTaskStartScheduler\n") );
eventLogAdd("vTaskStartScheduler");
	vTaskStartScheduler();

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the idle and/or
	timer tasks	to be created.  See the memory management section on the
	FreeRTOS web site for more details.  http://www.freertos.org/a00111.html */
	for( ;; )
	{
	}
}
/*-----------------------------------------------------------*/

void HAL_RNG_MspInit(RNG_HandleTypeDef *hrng)
{
	( void ) hrng;
//	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
	__HAL_RCC_RNG_CLK_ENABLE();

//	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
//	PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
//	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
	/* Enable RNG clock source */
	RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
	
	/* RNG Peripheral enable */
	RNG->CR |= RNG_CR_RNGEN;

	/*Select PLLQ output as RNG clock source */
//	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RNG;
//	PeriphClkInitStruct.RngClockSelection = RCC_RNGCLKSOURCE_PLL;
//	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
}

BaseType_t xApplicationGetRandomNumber( uint32_t *pulValue )
{
HAL_StatusTypeDef xResult;
BaseType_t xReturn;
uint32_t ulValue;

	xResult = HAL_RNG_GenerateRandomNumber( &hrng, &ulValue );
	if( xResult == HAL_OK )
	{
		xReturn = pdPASS;
		*pulValue = ulValue;
	}
	else
	{
		xReturn = pdFAIL;
	}
	return xReturn;
}

BaseType_t xRandom32( uint32_t *pulValue )
{
	return xApplicationGetRandomNumber( pulValue );
}

#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
	static void prvCreateDiskAndExampleFiles( void )
	{
	#if( mainHAS_RAMDISK != 0 )
		static uint8_t ucRAMDisk[ mainRAM_DISK_SECTORS * mainRAM_DISK_SECTOR_SIZE ];
	#endif

		verboseLevel = 0;
		#if( mainHAS_RAMDISK != 0 )
		{
			FreeRTOS_printf( ( "Create RAM-disk\n" ) );
			/* Create the RAM disk. */
			pxRAMDisk = FF_RAMDiskInit( mainRAM_DISK_NAME, ucRAMDisk, mainRAM_DISK_SECTORS, mainIO_MANAGER_CACHE_SIZE );
			configASSERT( pxRAMDisk );

			/* Print out information on the RAM disk. */
			FF_RAMDiskShowPartition( pxRAMDisk );
		}
		#endif	/* mainHAS_RAMDISK */
		#if( mainHAS_SDCARD != 0 ) && ( USE_PLUS_FAT != 0 )
		{
			FreeRTOS_printf( ( "Mount SD-card\n" ) );
			/* Create the SD card disk. */
			pxSDDisk = FF_SDDiskInit( mainSD_CARD_DISK_NAME );
			FreeRTOS_printf( ( "Mount SD-card done\n" ) );
			#if( mainRUN_STDIO_TESTS == 1 )
			if( pxSDDisk != NULL )
			{
				/* Remove the base directory again, ready for another loop. */
				ff_deltree( mainSD_CARD_TESTING_DIRECTORY );

				/* Make sure that the testing directory exists. */
				ff_mkdir( mainSD_CARD_TESTING_DIRECTORY );

				/* Create a few example files on the disk.  These are not deleted again. */
				vCreateAndVerifyExampleFiles( mainSD_CARD_TESTING_DIRECTORY );

				/* A few sanity checks only - can only be called after 
				vCreateAndVerifyExampleFiles().  NOTE:  The tests take a relatively long 
				time to execute and the FTP and HTTP servers will not start until the 
				tests have completed. */

				vStdioWithCWDTest( mainSD_CARD_TESTING_DIRECTORY );
			}
			#endif

		}
		#endif	/* mainHAS_SDCARD */
	}
	#endif /* ( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) ) */

/*-----------------------------------------------------------*/

#if( USE_PLUS_FAT != 0 )
	static int iFATRunning = 0;

	static void prvFileSystemAccessTask( void *pvParameters )
	{
	const char *pcBasePath = ( const char * ) pvParameters;

		while( iFATRunning != 0 )
		{
			ff_deltree( pcBasePath );
			ff_mkdir( pcBasePath );
			vCreateAndVerifyExampleFiles( pcBasePath );
			vStdioWithCWDTest( pcBasePath );
		}
		FreeRTOS_printf( ( "%s: done\n", pcBasePath ) );
		vTaskDelete( NULL );
	}

#endif	/* USE_PLUS_FAT */

#if( USE_TELNET != 0 )
	Telnet_t *pxTelnetHandle = NULL;

	void vUDPLoggingHook( const char *pcMessage, BaseType_t xLength )
	{
		if (pxTelnetHandle != NULL && pxTelnetHandle->xClients != NULL) {
			xTelnetSend (pxTelnetHandle, NULL, pcMessage, xLength );
		}
		#if( USE_USART3_LOGGING != 0 )
		//HAL_USART_Transmit(&huart3, (uint8_t *)pcMessage, xLength, 100);
		HAL_UART_Transmit(&huart3, (uint8_t *)pcMessage, xLength, 100);
		#endif
	}
#endif

