htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
#if( ipconfigUSE_DHCP_HOOK != 0 )
eDHCPCallbackAnswer_t xApplicationDHCPHook( eDHCPCallbackPhase_t eDHCPPhase, uint32_t ulIPAddress )
{
eDHCPCallbackAnswer_t eAnswer = eDHCPContinue;

	const char *name = "Unknown";
	switch( eDHCPPhase )
	{
	case eDHCPPhasePreDiscover:
		{
			name = "Discover";			/* Driver is about to send a DHCP discovery. */
//#warning Testing here
//			eAnswer = eDHCPUseDefaults;
		}
		break;
	case eDHCPPhasePreRequest:
		{
			name = "Request";			/* Driver is about to request DHCP an IP address. */
//#warning Testing here
//			eAnswer = eDHCPUseDefaults;
		}
		break;
	}
	FreeRTOS_printf( ( "DHCP %s address %lxip\n", name, FreeRTOS_ntohl( ulIPAddress ) ) );
	return eAnswer;
}
#endif	/* ipconfigUSE_DHCP_HOOK */

#if( ipconfigMULTI_INTERFACE == 0 )
	void dnsFound (const char *pcName, void *pvSearchID, uint32_t aIp)
	{
		FreeRTOS_printf( ( "DNS: '%s' found at %lxip\n", pcName, FreeRTOS_ntohl( aIp ) ) );
	}
#endif

#if 1
static void prvServerWorkTask( void *pvParameters )
{
#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
	const TickType_t xInitialBlockTime = pdMS_TO_TICKS( 200UL );
	BaseType_t xWasPresent, xIsPresent;
#endif
BaseType_t xHadSocket = pdFALSE;

eventLogAdd("prvServerWorkTask");

/* A structure that defines the servers to be created.  Which servers are
included in the structure depends on the mainCREATE_HTTP_SERVER and
mainCREATE_FTP_SERVER settings at the top of this file. */
#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
	static const struct xSERVER_CONFIG xServerConfiguration[] =
	{
		#if( mainCREATE_HTTP_SERVER == 1 )
				/* Server type,		port number,	backlog, 	root dir. */
				{ eSERVER_HTTP, 	80, 			12, 		configHTTP_ROOT },
		#endif
	
		#if( mainCREATE_FTP_SERVER == 1 )
				/* Server type,		port number,	backlog, 	root dir. */
				{ eSERVER_FTP,  	21, 			12, 		"" }
		#endif
	};
#endif

	/* Remove compiler warning about unused parameter. */
	( void ) pvParameters;

	/* If the CLI is included in the build then register commands that allow
	the file system to be accessed. */
	#if( mainCREATE_UDP_CLI_TASKS == 1 )
	{
		vRegisterFileSystemCLICommands();
	}
	#endif /* mainCREATE_UDP_CLI_TASKS */



	/* The priority of this task can be raised now the disk has been
	initialised. */
	vTaskPrioritySet( NULL, mainTCP_SERVER_TASK_PRIORITY );

	/* Wait until the network is up before creating the servers.  The
	notification is given from the network event hook. */
	ulTaskNotifyTake( pdTRUE, portMAX_DELAY );


	FreeRTOS_printf( ( "prvServerWorkTask starts running\n" ) );

	/* Create the servers defined by the xServerConfiguration array above. */
#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
	pxTCPServer = FreeRTOS_CreateTCPServer( xServerConfiguration, sizeof( xServerConfiguration ) / sizeof( xServerConfiguration[ 0 ] ) );
	configASSERT( pxTCPServer );
#endif

	#if( CONFIG_USE_LWIP != 0 )
	{
		vLWIP_Init();
	}
	#endif
	xServerSemaphore = xSemaphoreCreateBinary();
	configASSERT( xServerSemaphore != NULL );

	#if( USE_TELNET != 0 )
	Telnet_t xTelnet;
	memset( &xTelnet, '\0', sizeof xTelnet );
	#endif

	#if( HAS_TCP_TESTER != 0 )
		tcp_test_start();
	#endif

	for( ;; )
	{
	TickType_t xReceiveTimeOut = pdMS_TO_TICKS( 200 );

		xSemaphoreTake( xServerSemaphore, xReceiveTimeOut );
		if( xPingReady )
		{
#if( ipconfigUSE_IPv6 != 0 )
FreeRTOS_printf( ( "xPingReady %d xPing4t %d xPing6 %d\n", ( int ) xPingReady, ( int ) xPing4Count, ( int ) xPing6Count ) );
#else
FreeRTOS_printf( ( "xPingReady %d xPing4t %d\n", ( int ) xPingReady, ( int ) xPing4Count ) );
#endif
			xPingReady = pdFALSE;
			if( xPing4Count >= 0 && xPing4Count < PING_COUNT_MAX )
			{
				FreeRTOS_SendPingRequest( ulPingIPAddress, 10, 10 );
			}
		#if( ipconfigUSE_IPv6 != 0 )
			if( xPing6Count >= 0 && xPing6Count < PING_COUNT_MAX )
			{
				FreeRTOS_SendPingRequestIPv6( &xPing6IPAddress, 10, 10 );
			}
		#endif
		}
		#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
		if (doMountCard) {
			doMountCard = 0;
		/* Create the disk used by the FTP and HTTP servers. */
			FreeRTOS_printf( ( "Creating files\n" ) );
			prvCreateDiskAndExampleFiles();
			cardMounted = pxSDDisk;
			if (cardMounted) {
				xIsPresent = xWasPresent = FF_SDDiskDetect( pxSDDisk );
			}
			FreeRTOS_printf( ( "FF_SDDiskDetect returns -> %ld\n", xIsPresent  ) );
		}
		if (cardMounted) {
			xIsPresent = FF_SDDiskDetect( pxSDDisk );
			if (xWasPresent != xIsPresent )
			{
				if( xIsPresent == pdFALSE )
				{
					FreeRTOS_printf( ( "SD-card now removed (%ld -> %ld)\n", xWasPresent, xIsPresent ) );
					if( ( pxSDDisk != NULL ) && ( pxSDDisk->pxIOManager != NULL ) )
					{
						/* Invalidate all open file handles so they
						will get closed by the application. */
						FF_Invalidate( pxSDDisk->pxIOManager );
						FF_SDDiskUnmount( pxSDDisk );
					}
				}
				else
				{
					FreeRTOS_printf( ( "SD-card now present (%ld -> %ld)\n", xWasPresent, xIsPresent ) );
					if( pxSDDisk != NULL )
					{
					BaseType_t xResult;
						FF_SDDiskReinit( pxSDDisk );
						xResult = FF_SDDiskMount( pxSDDisk );
						FF_PRINTF( "FF_SDDiskMount: SD-card %s\n", xResult > 0 ? "OK" : "Failed" );
						if( xResult > 0 )
						{
							FF_SDDiskShowPartition( pxSDDisk );
						}
					}
					else
					{
						prvCreateDiskAndExampleFiles();
					}
				}
				xWasPresent = xIsPresent;
			}
			else
			{
	//				FreeRTOS_printf( ( "SD-card still %d\n", xIsPresent ) );
			}
			FreeRTOS_TCPServerWork( pxTCPServer, xInitialBlockTime );
		}
		#endif /* mainCREATE_FTP_SERVER == 1 || mainCREATE_HTTP_SERVER == 1 */

		#if( configUSE_TIMERS == 0 )
		{
			/* As there is not Timer task, toggle the LED 'manually'. */
//				vParTestToggleLED( mainLED );
			HAL_GPIO_TogglePin(GPIOG, GPIO_PIN_6);
		}
		#endif
		xSocket_t xSocket = xLoggingGetSocket();
		struct freertos_sockaddr xSourceAddress;
		socklen_t xSourceAddressLength = sizeof( xSourceAddress );
//{
//	extern void vSocketWakeupCallback( Socket_t xSocket );
//
//	FreeRTOS_setsockopt( xSocket, 0, FREERTOS_SO_WAKEUP_CALLBACK, &( vSocketWakeupCallback ),  sizeof( void * ) );
//	#error disable please
//}

		if( xSocket != NULL)
		{
		char cBuffer[ 64 ];
		BaseType_t xCount;

			if( xHadSocket == pdFALSE )
			{
				xHadSocket = pdTRUE;
				FreeRTOS_printf( ( "prvCommandTask started\n" ) );
				/* xServerSemaphore will be given to when there is data for xSocket
				and also as soon as there is USB/CDC data. */
				FreeRTOS_setsockopt( xSocket, 0, FREERTOS_SO_SET_SEMAPHORE, ( void * ) &xServerSemaphore, sizeof( xServerSemaphore ) );
				//FreeRTOS_setsockopt( xSocket, 0, FREERTOS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );
				#if( ipconfigUSE_CALLBACKS != 0 )
				{
					F_TCP_UDP_Handler_t xHandler;
					memset( &xHandler, '\0', sizeof ( xHandler ) );
					xHandler.pOnUdpReceive = xOnUdpReceive;
					FreeRTOS_setsockopt( xSocket, 0, FREERTOS_SO_UDP_RECV_HANDLER, ( void * ) &xHandler, sizeof( xHandler ) );
				}
				#endif
				#if( USE_TELNET != 0 )
				{
					xTelnetCreate( &xTelnet, TELNET_PORT_NUMBER );
					if( xTelnet.xParentSocket != 0 )
					{
						FreeRTOS_setsockopt( xTelnet.xParentSocket, 0, FREERTOS_SO_SET_SEMAPHORE, ( void * ) &xServerSemaphore, sizeof( xServerSemaphore ) );
						pxTelnetHandle = &xTelnet;
					}
				}
				#endif
				#if( USE_ECHO_TASK != 0 )
				{
					vStartTCPEchoClientTasks_SingleTasks( configMINIMAL_STACK_SIZE * 4, tskIDLE_PRIORITY + 1 );
				}
				#endif /* ( USE_ECHO_TASK != 0 ) */
			}
			xCount = FreeRTOS_recvfrom( xSocket, ( void * )cBuffer, sizeof( cBuffer ) - 1, FREERTOS_MSG_DONTWAIT,
				&xSourceAddress, &xSourceAddressLength );
			#if( USE_TELNET != 0 )
			{
				if( ( xCount <= 0 ) && ( xTelnet.xParentSocket != NULL ) )
				{
					struct freertos_sockaddr fromAddr;
					xCount = xTelnetRecv( &xTelnet, &fromAddr, cBuffer, sizeof( cBuffer ) - 1 );
					if( xCount > 0 )
					{
						xTelnetSend( &xTelnet, &fromAddr, cBuffer, xCount );
					}
				}
			}
			#endif
			if( xCount > 0 )
			{
				cBuffer[ xCount ] = '\0';
				while( ( xCount > 0 ) && ( ( cBuffer[ xCount - 1 ] == 13 ) || ( cBuffer[ xCount - 1 ] == 10 ) ) )
				{
					cBuffer[ --xCount ] = 0;
				}
				FreeRTOS_printf( ( ">> %s\n", cBuffer ) );
				if( strncmp( cBuffer, "ver", 3 ) == 0 )
				{
				int level;

					if( sscanf( cBuffer + 3, "%d", &level ) == 1 )
					{
						verboseLevel = level;
					}
					FreeRTOS_printf( ( "Verbose level %d  port %d IP %lxip seed %08lx\n",
						verboseLevel,
						FreeRTOS_ntohs( xSourceAddress.sin_port ),
						FreeRTOS_ntohl( xSourceAddress.sin_addr ),
						ulInitialSeed ) );
vRegisterDelay();
//				} else if( strncmp( cBuffer, "inhibit", 7 ) == 0 ) {
//					extern unsigned tcpInhibit;
//					int number = 0;
//					const char *ptr = cBuffer + 7;
//					while( *ptr && !isdigit( *ptr ) ) ptr++;
//					if (*ptr) {
//						int number;
//						sscanf (ptr, "%d", &number);
//						const char tosend[] = 
//							"123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789\n"
//							"123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789\n"
//							"123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789\n"
//							"123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789\n";
//						vTaskDelay( 100U );
//						xTelnetSend( &xTelnet, NULL, tosend, sizeof tosend );
//						vTaskDelay( 100U );
//						tcpInhibit = number;
//						xTelnetSend( &xTelnet, NULL, tosend, sizeof tosend );
//					}

				} else if( strncmp( cBuffer, "ntoa", 4 ) == 0 ) {
					uint32_t addresses[] = {
						0xC0A8027C,
						0x00A8027C,
						0xC000027C,
						0xC0A8007C,
						0xC0A80200,
						0x00000000,
						0xFFFFFFFF,
						0x000A64C8,
						0xC8640A00,
					};
					for (int i = 0; i < ARRAY_SIZE( addresses ); i++)
					{
						uint32_t ulIPAddress = FreeRTOS_ntohl( addresses[ i ] );
//						uint32_t ulIPAddress = addresses[ i ];
						char buffer[18];
						char *pcResult;
						memset(buffer, '\0', sizeof buffer);
						pcResult = FreeRTOS_inet_ntoa( ulIPAddress, buffer ); // , sizeof buffer );
						if( pcResult == NULL )
						{
							pcResult = "Overflow";
						}
						FreeRTOS_printf( ( "%-15lxip equals %-15s\n", FreeRTOS_ntohl( ulIPAddress ), pcResult ) );
					}
				} else if( strncmp( cBuffer, "ntos", 4 ) == 0 ) {
					for (int space = 16; space > 8; space -= 1)
					{
					uint32_t addresses[] = {
						0xFFFFFFFF,
						0x000A64C8,
						0x00000000,
					};
						for (int i = 0; i < ARRAY_SIZE( addresses ); i++)
						{
							uint32_t ulIPAddress = FreeRTOS_ntohl( addresses[ i ] );
	//						uint32_t ulIPAddress = addresses[ i ];
							char buffer[18];
							char *pcResult;
							memset(buffer, '\0', sizeof buffer);
							pcResult = FreeRTOS_inet_ntoa( ulIPAddress, buffer ); // , space );
							if( pcResult == NULL )
							{
								pcResult = "Overflow";
							}
							FreeRTOS_printf( ( "%2d : %-15lxip equals %-15s\n", space, FreeRTOS_ntohl( ulIPAddress ), pcResult ) );
						}
					}
				} else if( strncmp( cBuffer, "rand", 4 ) == 0 ) {
					uint32_t ulNumber = 0x5a5a5a5a;
					BaseType_t rc = xRandom32( &ulNumber );
					if (rc == pdPASS )
					{
						char buffer[33];
						int index;
						uint32_t ulMask = 0x80000000uL;
						for( index = 0; index < 32; index++ )
						{
							buffer[index] = ((ulNumber & ulMask) != 0) ? '1' : '0';;
							ulMask >>= 1;
						}
						buffer[index] = '\0';
						FreeRTOS_printf( ("Random %08lx (%s)\n", ulNumber, buffer ) );
					}
					else
					{
						FreeRTOS_printf( ("Random failed\n" ) );
					}
			#if( ipconfigUSE_IPv6 != 0 )
				} else if (strncmp(cBuffer, "trial", 5) == 0) {
					IPv6_Address_t xIPAddress;
					IPv6_Address_t xPrefix;
					IPv6_Address_t xGateWay;
					IPv6_Address_t xDNSServer;

					FreeRTOS_inet_pton6( "2001:470:ec54::", xPrefix.ucBytes );
					FreeRTOS_inet_pton6( "2001:4860:4860::8888", xDNSServer.ucBytes );			

					FreeRTOS_CreateIPv6Address( &xIPAddress, &xPrefix, 64, pdTRUE );
					FreeRTOS_inet_pton6( "fe80::9355:69c7:585a:afe7", xGateWay.ucBytes );
					FreeRTOS_printf( ( "Prefix %pip IP %pip GW %pip DNS %pip \n",
						xPrefix.ucBytes,
						xIPAddress.ucBytes,
						xGateWay.ucBytes,
						xDNSServer.ucBytes ) );

				} else if (strncmp(cBuffer, "size", 4) == 0) {
FreeRTOS_printf( ( "-ss%u  ", sizeof(short) ) );
FreeRTOS_printf( ( "-si%u  ", sizeof(int) ) );
FreeRTOS_printf( ( "-sl%u  ", sizeof(long) ) );
FreeRTOS_printf( ( "-sll%u  ", sizeof(long long) ) );
FreeRTOS_printf( ( "-sf%u  ", sizeof(float) ) );
FreeRTOS_printf( ( "-sd%u  ", sizeof(double) ) );
FreeRTOS_printf( ( "-sld%u  ", sizeof(long double) ) );
FreeRTOS_printf( ( "-sp%u  ", sizeof(void*) ) );
FreeRTOS_printf( ( "-sw%u  ", sizeof(wchar_t) ) );
			#endif /* ( ipconfigUSE_IPv6 != 0 ) */
			#if( HAS_SDRAM_TEST != 0 )
				} else if (strncmp(cBuffer, "memtest", 7) == 0) {
					extern void sdram_test( void );
					sdram_test();
			#endif	/* ( HAS_SDRAM_TEST != 0 ) */
			#if( ipconfigUSE_IPv6 != 0 )
				} else if( strncmp( cBuffer, "whatismyip", 4 ) == 0 ) {
					NetworkEndPoint_t *pxEndPoint;

					for( pxEndPoint = FreeRTOS_FirstEndPoint( NULL );
						pxEndPoint != NULL;
						pxEndPoint = FreeRTOS_NextEndPoint( NULL, pxEndPoint ) )
					{
						if( pxEndPoint->bits.bIPv6 )
						{
							FreeRTOS_printf( ( "%pip\n", pxEndPoint->ipv6_settings.xIPAddress.ucBytes ) );
						}
						else
						{
							FreeRTOS_printf( ( "%lxip\n", FreeRTOS_ntohl( pxEndPoint->ipv4_settings.ulIPAddress ) ) );
						}
					}
			#endif
			#if( ipconfigMULTI_INTERFACE != 0 )
				} else if( strncmp( cBuffer, "route", 5 ) == 0 ) {
					extern uint32_t xDoLog;
					char *ptr = cBuffer + 5;
					while( *ptr && !isdigit( *ptr ) ) ptr++;
					if( *ptr )
					{
					//char buffer[128];
					//int errnum;
						sscanf( ptr, "%lu", &xDoLog);
						FreeRTOS_printf( ( "xDoLog = %lu\n", xDoLog ) );
					}
			#endif /* ipconfigMULTI_INTERFACE */
				} else if( strncmp( cBuffer, "errno", 4 ) == 0 ) {
					char *ptr = cBuffer + 4;
					while( *ptr && !isdigit( *ptr ) ) ptr++;
					if( *ptr )
					{
					char buffer[128];
					int errnum;
						sscanf( ptr, "%d", &errnum);
						FreeRTOS_printf( ( "errno %d = '%s'\n",
							errnum, FreeRTOS_strerror_r( errnum, buffer, sizeof buffer ) ) );
					}
			#if( USE_ECHO_TASK != 0 )
				} else if( strncmp( cBuffer, "echo", 4 ) == 0 ) {
					int number = 0;
					BaseType_t xDone = pdFALSE;
					const char *ptr = cBuffer + 4;
					while( *ptr && !isspace( *ptr ) ) ptr++;
					while( *ptr && !isdigit( *ptr ) ) ptr++;
					if (*ptr) {
						sscanf (ptr, "%d", &number);
						while( isdigit( *ptr ) ) ptr++;
						while( isspace( *ptr ) ) ptr++;
						if( *ptr ) {
							wakeupEchoClient( number, ptr );
							xDone = pdTRUE;
						}
					}
					if( !xDone )
					{
						FreeRTOS_printf( ( "Usage: echo 0|1 IP-address\n" ) );
					}
			#endif /* ( USE_ECHO_TASK != 0 ) */
				} else if( strncmp( cBuffer, "udp", 3 ) == 0 ) {
					const char pcMessage[] = "1234567890";
					const char *ptr = cBuffer + 3;
					while (*ptr && !isspace (*ptr)) ptr++;
					while (isspace (*ptr)) ptr++;
					if (*ptr) {
					} else {
						ptr = pcMessage;
					}

					#if( ipconfigUSE_IPv6 != 0 )
					{
					int index;
						const char *ip_address[] = {
							"fe80::9355:69c7:585a:afe7",	/* raspberry ff02::1:ff5a:afe7, 33:33:ff:5a:af:e7 */
							"fe80::6816:5e9b:80a0:9edb",	/* laptop Hein */
						};
						for (index = 0; index < ARRAY_SIZE(ip_address); index++) {
							struct freertos_sockaddr6 xAddress;
							memset( &xAddress, '\0', sizeof xAddress );
							xAddress.sin_len = sizeof( xAddress );		/* length of this structure. */
							xAddress.sin_family = FREERTOS_AF_INET6;
							xAddress.sin_port = FreeRTOS_htons( configUDP_LOGGING_PORT_REMOTE );
							xAddress.sin_flowinfo = 0;	/* IPv6 flow information. */
							FreeRTOS_inet_pton6( ip_address[ index ], xAddress.sin_addrv6.ucBytes );
							FreeRTOS_sendto( xSocket, ptr, strlen( ptr ), 0, ( const struct freertos_sockaddr * ) &( xAddress ), sizeof( xAddress ) );
						}
					}
					#endif
/*
					{
						struct freertos_sockaddr xAddress_IPv4;
						xAddress_IPv4.sin_family = FREERTOS_AF_INET4;
						xAddress_IPv4.sin_len = sizeof( xAddress_IPv4 );		// length of this structure
						xAddress_IPv4.sin_port = FreeRTOS_htons( configUDP_LOGGING_PORT_REMOTE );
						xAddress_IPv4.sin_addr = FreeRTOS_inet_addr_quick( 192, 168, 2, 5 );

