htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
						FreeRTOS_sendto( xSocket, ptr, strlen( ptr ), 0, &( xAddress_IPv4 ), sizeof( xAddress_IPv4 ) );
					}
*/
			#if( ipconfigUSE_IPv6 != 0 )
				} else if( strncmp( cBuffer, "address", 7 ) == 0 ) {
					IPv6_Address_t xPrefix, xIPAddress;
					xPrefix.ucBytes[ 0 ] = 0xfe;
					xPrefix.ucBytes[ 1 ] = 0x80;
					memset( xPrefix.ucBytes + 2, '\0', sizeof( xPrefix.ucBytes ) - 2 );
					FreeRTOS_CreateIPv6Address( &xIPAddress, &xPrefix, 64, pdTRUE );
					FreeRTOS_printf( ( "IP address = %pip\n", xIPAddress.ucBytes ) );

					/* 2001:470:ec54 */
					/* 2001:0470:ec54 */
					xPrefix.ucBytes[ 0 ] = 0x20;
					xPrefix.ucBytes[ 1 ] = 0x01;
					xPrefix.ucBytes[ 2 ] = 0x04;
					xPrefix.ucBytes[ 3 ] = 0x70;
					xPrefix.ucBytes[ 4 ] = 0xec;
					xPrefix.ucBytes[ 5 ] = 0x54;
					xPrefix.ucBytes[ 6 ] = 0x00;
					xPrefix.ucBytes[ 7 ] = 0x00;
					memset( xPrefix.ucBytes + 8, '\0', sizeof( xPrefix.ucBytes ) - 8 );
					FreeRTOS_CreateIPv6Address( &xIPAddress, &xPrefix, 64, pdTRUE );
					FreeRTOS_printf( ( "IP address = %pip\n", xIPAddress.ucBytes ) );
			#endif
			#if( ipconfigUSE_IPv6 != 0 )
				} else if( strncmp( cBuffer, "test2", 5 ) == 0 ) {
					IPv6_Address_t xLeft, xRight;
					struct SPair {
						const char *pcLeft;
						const char *pcRight;
						int prefixLength;
					};
					struct SPair pairs[] = {
						{  "2001:470:ec54::",  "2001:470:ec54::", 64 },
						{  "fe80::",           "fe80::"         , 10 },
						{  "fe80::",           "feBF::"         , 10 },
						{  "fe80::",           "feff::"         , 10 },
					};
					int index;
					for( index = 0; index < ARRAY_SIZE( pairs ); index++) {
					BaseType_t xResult;
					
						FreeRTOS_inet_pton6( pairs[index].pcLeft, xLeft.ucBytes );
						FreeRTOS_inet_pton6( pairs[index].pcRight, xRight.ucBytes );
						xResult = xCompareIPv6_Address( &xLeft, &xRight, 10 );
						FreeRTOS_printf( ( "Compare %pip with %pip = %s\n", xLeft.ucBytes, xRight.ucBytes, xResult ? "differ" : "same" ) );
					}
			#endif /* ( ipconfigUSE_IPv6 != 0 ) */
			#if( ipconfigMULTI_INTERFACE != 0 )
				} else if( strncmp( cBuffer, "ifconfig", 4 ) == 0 ) {
					NetworkInterface_t *pxInterface;
					NetworkEndPoint_t *pxEndPoint;

					for( pxInterface = FreeRTOS_FirstNetworkInterface();
						pxInterface != NULL;
						pxInterface = FreeRTOS_NextNetworkInterface( pxInterface ) )
					{
						FreeRTOS_printf( ( "Interface %s\n", pxInterface->pcName ) );
						for( pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
							pxEndPoint != NULL;
							pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
						{
							showEndPoint( pxEndPoint );
						}
					}
			#endif	/* ipconfigMULTI_INTERFACE */
			#if( ipconfigMULTI_INTERFACE != 0 )
				} else if( strncmp( cBuffer, "dnsq", 4 ) == 0 ) {
					#if( ipconfigUSE_LLMNR == 0 )
					{
						FreeRTOS_printf( ( "Warning: LLMNR not enabled\n" ) );
					}
					#endif
					BaseType_t xDoClear = pdFALSE;
					BaseType_t xIPVersion = 4;
					char *ptr = cBuffer + 4;
					for (; *ptr && !isspace (*ptr); ptr++) {
						if( ptr[0] == '6' ) {
							xIPVersion = 6;
						} else if( ptr[0] == 'c' ) {
							xDoClear = pdTRUE;
						}
					}
					while (isspace (*ptr)) ptr++;
					if (*ptr) {
					struct freertos_addrinfo *pxResult;
						pxResult = pxDNSLookup( ptr, xIPVersion, xDoClear );
						#if( ipconfigMULTI_INTERFACE != 0 )
						FreeRTOS_freeaddrinfo( pxResult );
						#endif
					} else {
						FreeRTOS_printf( ( "Usage: dnsquery <name>\n" ) );
					}
			#else
				} else if( strncmp( cBuffer, "dnsq", 4 ) == 0 ) {
					char *ptr = cBuffer + 4;
					while (*ptr && !isspace (*ptr)) ptr++;
					while (isspace (*ptr)) ptr++;
					unsigned tmout = 4000;
					static unsigned searchID;
					if (*ptr) {
						for (char *target = ptr; *target; target++) {
							if (isspace (*target)) {
								*target = '\0';
								break;
							}
						}
						FreeRTOS_printf( ("DNS query: '%s'\n", ptr ) );
#if( ipconfigDNS_USE_CALLBACKS != 0 )
						uint32_t ip = FreeRTOS_gethostbyname_a (ptr, dnsFound, (void*)++searchID, tmout);
#else
						uint32_t ip;
						int count;
						#if( ipconfigUSE_DNS_CACHE != 0 )
						{
							FreeRTOS_dnsclear();
						}
						#endif
						for (count = 0; count < 5; count++) {
							ip = FreeRTOS_gethostbyname (ptr);
							FreeRTOS_printf( ( "Lookup: %lxip\n", ip ) );
							if (ip == 0U)
								break;
						}
#endif
						if (ip)
							FreeRTOS_printf( ("%s : %lxip\n", ptr, FreeRTOS_ntohl( ip ) ) );
					} else {
						FreeRTOS_printf( ("Usage: dnsquery <name>\n" ) );
					}
			#endif /* ipconfigMULTI_INTERFACE != 0 */
				} else if( strncmp( cBuffer, "check", 5 ) == 0 ) {
					checksum_test();
			#if( ipconfigMULTI_INTERFACE != 0 )
				} else if( strncmp( cBuffer, "ping", 4 ) == 0 ) {
					BaseType_t xDoClear = pdFALSE;
					BaseType_t xIPVersion = 4;
					struct freertos_addrinfo *pxDNSResult = NULL;
					char *ptr = cBuffer + 4;
					pingLogging = pdFALSE;
					while (*ptr && !isspace(*ptr)) {
						switch (*ptr) {
						case 'c':  xDoClear    = pdTRUE; break;
						case 'v':  pingLogging = pdTRUE; break;
						#if( ipconfigUSE_IPv6 != 0 )
						case '6':  xIPVersion  = 6; break;
						#endif
						}
						ptr++;
					}

					while (isspace( *ptr )) ptr++;
					char *pcHostname = ptr;
					if (*pcHostname == '\0') {
						#if( ipconfigUSE_IPv6 != 0 )
						if( xIPVersion == 6 )
						{
							pcHostname = "fe80::6816:5e9b:80a0:9edb";
						}
						else
						#endif
						{
							pcHostname = "192.168.2.1";
						}
					}
					#if( ipconfigUSE_IPv6 != 0 )
					if( strchr( pcHostname, ':' ) != NULL )
					{
					IPv6_Address_t xAddress_IPv6;	/*lint !e9018 declaration of symbol 'xAddress_IPv6' with union based type 'const IPv6_Address_t' [MISRA 2012 Rule 19.2, advisory]. */

						/* ulIPAddress does not represent an IPv4 address here. It becomes non-zero when the look-up succeeds. */
						if( FreeRTOS_inet_pton6( pcHostname, xAddress_IPv6.ucBytes ) != 0 )
						{
							xIPVersion = 6;
						}
					}
					else if( strchr( pcHostname, '.' ) != NULL )
					{
					uint32_t ulIPAddress;

						ulIPAddress = FreeRTOS_inet_addr( pcHostname );
						if( ulIPAddress != 0 && ulIPAddress != ~0uL )
						{
							xIPVersion = 4;
						}
					}
					#endif
					FreeRTOS_printf( ( "ping%d: looking up name '%s'\n", ( int ) xIPVersion, pcHostname ) );
					if( xDoClear )
					{
						#if( ipconfigUSE_DNS_CACHE != 0 )
						{
							FreeRTOS_dnsclear();
						}
						#endif /* ipconfigUSE_DNS_CACHE */
						#if( ipconfigMULTI_INTERFACE != 0 )
							FreeRTOS_ClearARP( NULL );
						#else
							FreeRTOS_ClearARP();
						#endif
					}
					pxDNSResult = pxDNSLookup( pcHostname, xIPVersion, xDoClear );
					if ( pxDNSResult != NULL )
					{
					BaseType_t xCallCount = xDoClear ? 2 : 1;
						#if( ipconfigUSE_IPv6 != 0 )
						if( xIPVersion == 6 )
						{
							FreeRTOS_printf( ( "ping6 to '%s' (%pip)\n", pcHostname, pxDNSResult->xPrivateStorage.sockaddr6.sin_addrv6.ucBytes ) );
							xPing4Count = -1;
							xPing6Count = 0;
							memcpy( xPing6IPAddress.ucBytes, pxDNSResult->xPrivateStorage.sockaddr6.sin_addrv6.ucBytes, ipSIZE_OF_IPv6_ADDRESS );
							while( xCallCount-- )
							{
								FreeRTOS_SendPingRequestIPv6( &xPing6IPAddress, 10, 10 );
							}
						}
						else
						#endif
						{
							FreeRTOS_printf( ( "ping4 to '%s' (%lxip)\n", pcHostname, FreeRTOS_ntohl( pxDNSResult->ai_addr->sin_addr ) ) );
							xPing4Count = 0;
							#if( ipconfigUSE_IPv6 != 0 )
							xPing6Count = -1;
							#endif
							ulPingIPAddress = pxDNSResult->ai_addr->sin_addr;
							while( xCallCount-- )
							{
								FreeRTOS_SendPingRequest( ulPingIPAddress, 10, 10 );
							}
						}
					}
					else
					{
						FreeRTOS_printf( ( "ping -%d: '%s' not found\n", ( int ) xIPVersion, ptr ) );
					}
			#else
				} else if( strncmp( cBuffer, "ping", 4 ) == 0 ) {
					BaseType_t xDoClear = pdFALSE;
					uint32_t ulIPAddress;
					char *ptr = cBuffer + 4;

					pingLogging = pdFALSE;
					PING_COUNT_MAX = 10;

