htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
					while (*ptr && !isspace(*ptr)) {
						if (*ptr == 'c')
							xDoClear = pdTRUE;
						if (*ptr == 'v')
							pingLogging = pdTRUE;
						ptr++;
					}
					while (isspace(*ptr)) ptr++;

					#if( ipconfigMULTI_INTERFACE != 0 )
					{
						ulIPAddress = FreeRTOS_inet_addr_quick( ucIPAddress[0], ucIPAddress[1], ucIPAddress[2], ucIPAddress[3] );
					}
					#else
					{
						FreeRTOS_GetAddressConfiguration( &ulIPAddress, NULL, NULL, NULL );
					}
					#endif

					if (*ptr) {
						char *rest = strchr(ptr, ' ');
						if (rest) {
							*(rest++) = '\0';
						}
						ulIPAddress = FreeRTOS_inet_addr( ptr );
						while (*ptr && !isspace(*ptr)) ptr++;
						unsigned count;
						if (rest != NULL && sscanf(rest, "%u", &count) > 0) {
							PING_COUNT_MAX = count;
						}
					}
					FreeRTOS_printf( ( "ping to %lxip\n", FreeRTOS_htonl(ulIPAddress) ) );

					ulPingIPAddress = ulIPAddress;
					xPing4Count = 0;
				#if( ipconfigUSE_IPv6 != 0 )
					xPing6Count = -1;
				#endif /* ( ipconfigUSE_IPv6 != 0 ) */
					xPingReady = pdFALSE;
					if( xDoClear )
					{
						#if( ipconfigMULTI_INTERFACE != 0 )
							FreeRTOS_ClearARP( NULL );
						#else
							FreeRTOS_ClearARP();
						#endif
						FreeRTOS_printf( ( "Clearing ARP cache\n" ) );
					}

					FreeRTOS_SendPingRequest( ulIPAddress, 10, 10 );
			#endif	/* ipconfigMULTI_INTERFACE */
			#if( HAS_ECHO_TEST != 0 )
				} else if( strncmp( cBuffer, "plus", 4 ) == 0 ) {
					int value = 1;
					char *ptr = cBuffer+4;
					while (*ptr && !isdigit(*ptr)) ptr++;
					if (!ulServerIPAddress)
						ulServerIPAddress = FreeRTOS_inet_addr_quick( ucIPAddress[0], ucIPAddress[1], ucIPAddress[2], ucIPAddress[3] );
					if (*ptr) {
						int value2;
						char ch;
						int rc = sscanf (ptr, "%d%c%d", &value, &ch, &value2);
						if (rc >= 3) {
							ulServerIPAddress = FreeRTOS_inet_addr( ptr );
							value = 1;
						} else if (rc < 1) {
							value = 0;
						}
					}
					plus_echo_start (value);
					FreeRTOS_printf( ( "Plus testing has %s for %lxip\n", value ? "started" : "stopped", ulServerIPAddress ) );
			#endif	/* ( HAS_ECHO_TEST != 0 ) */
				} else if( strncmp( cBuffer, "netstat", 7 ) == 0 ) {
					FreeRTOS_netstat();
				} else if( strncmp( cBuffer, "allow", 5 ) == 0 ) {
					unsigned value = 0;
					char *ptr = cBuffer+5;
					while (*ptr) {
						if (*ptr == '4') {
							value |= eIPv4;
						}
						if (*ptr == '6') {
							value |= eIPv6;
						}
						ptr++;
					}
					if (value) {
						allowIPVersion = (eIPVersion)value;
					}
					FreeRTOS_printf( ( "Allow%s%s\n",
						(allowIPVersion & eIPv4) ? " IPv4" : "",
						(allowIPVersion & eIPv6) ? " IPv6" : "" ) );
				}
				#if( USE_LOG_EVENT != 0 )
				{
					if( strncmp( cBuffer, "event", 4 ) == 0 )
					{
						if(cBuffer[ 5 ] == 'c')
						{
							int rc = iEventLogClear();
							lUDPLoggingPrintf( "cleared %d events\n", rc );
						}
						else
						{
							eventLogDump();
						}
					}
				}
				#endif /* USE_LOG_EVENT */
				if( strncmp( cBuffer, "list", 4 ) == 0 )
				{
					vShowTaskTable( cBuffer[ 4 ] == 'c' );
				}
				#if( mainHAS_RAMDISK != 0 )
				{
					if( strncmp( cBuffer, "dump", 4 ) == 0 )
					{
						FF_RAMDiskStoreImage( pxRAMDisk, "ram_disk.img" );
					}
				}
				#endif	/* mainHAS_RAMDISK */
				#if( USE_IPERF != 0 )
				{
					if( strncmp( cBuffer, "iperf", 5 ) == 0 )
					{
						vIPerfInstall();
					}
				}
				#endif	/* USE_IPERF */
				#if( USE_PLUS_FAT != 0 )
				if( strncmp( cBuffer, "format", 7 ) == 0 )
				{
					if( pxSDDisk != 0 )
					{
						FF_SDDiskFormat( pxSDDisk, 0 );
					}
				}
				#endif
				#if( mainHAS_FAT_TEST != 0 )
				{
					if( strncmp( cBuffer, "fattest", 7 ) == 0 )
					{
					int level = 0;
					const char pcMountPath[] = "/test";

						if( sscanf( cBuffer + 7, "%d", &level ) == 1 )
						{
							verboseLevel = level;
						}
						FreeRTOS_printf( ( "FAT test %d\n", level ) );
						ff_mkdir( pcMountPath );
						if( ( level != 0 ) && ( iFATRunning == 0 ) )
						{
						int x;

							iFATRunning = 1;
							if( level < 1 ) level = 1;
							if( level > 10 ) level = 10;
							for( x = 0; x < level; x++ )
							{
							char pcName[ 16 ];
							static char pcBaseDirectoryNames[ 10 ][ 16 ];
							sprintf( pcName, "FAT_%02d", x + 1 );
							snprintf( pcBaseDirectoryNames[ x ], sizeof pcBaseDirectoryNames[ x ], "%s/%d",
									pcMountPath, x + 1 );
							ff_mkdir( pcBaseDirectoryNames[ x ] );

#define mainFAT_TEST__TASK_PRIORITY	( tskIDLE_PRIORITY + 1 )
								xTaskCreate( prvFileSystemAccessTask,
											 pcName,
											 mainFAT_TEST_STACK_SIZE,
											 ( void * ) pcBaseDirectoryNames[ x ],
											 mainFAT_TEST__TASK_PRIORITY,
											 NULL );
							}
						}
						else if( ( level == 0 ) && ( iFATRunning != 0 ) )
						{
							iFATRunning = 0;
							FreeRTOS_printf( ( "FAT test stopped\n" ) );
						}
					}	/* if( strncmp( cBuffer, "fattest", 7 ) == 0 ) */
				}
				#endif /* mainHAS_FAT_TEST */
			}	/* if( xCount > 0 ) */
		}	/* if( xSocket != NULL) */
	}
}
/*-----------------------------------------------------------*/
#endif

uint32_t echoServerIPAddress()
{
	return ulServerIPAddress;
}
/*-----------------------------------------------------------*/

uint32_t HAL_GetTick()
{
	if (xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED)
	{
		static uint32_t ulCounter;
		ulCounter++;
		return ulCounter / 10;
	}
	else
	{
		return (uint32_t)xTaskGetTickCount();
	}
}

void vApplicationIdleHook( void )
{
}
/*-----------------------------------------------------------*/

volatile const char *pcAssertedFileName;
volatile int iAssertedErrno;
volatile uint32_t ulAssertedLine;
#if( USE_PLUS_FAT != 0 )
volatile FF_Error_t xAssertedFF_Error;
#endif
void vAssertCalled( const char *pcFile, uint32_t ulLine )
{
volatile uint32_t ulBlockVariable = 0UL;

	ulAssertedLine = ulLine;
#if( USE_PLUS_FAT != 0 )
	iAssertedErrno = stdioGET_ERRNO();
	xAssertedFF_Error = stdioGET_FF_ERROR( );
#endif
	pcAssertedFileName = strrchr( pcFile, '/' );
	if( pcAssertedFileName == 0 )
	{
		pcAssertedFileName = strrchr( pcFile, '\\' );
	}
	if( pcAssertedFileName != NULL )
	{
		pcAssertedFileName++;
	}
	else
	{
		pcAssertedFileName = pcFile;
	}
	FreeRTOS_printf( ( "vAssertCalled( %s, %ld\n", pcFile, ulLine ) );

