htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
	void assert_failed(uint8_t* pucFilename, uint32_t ulLineNr)
	{
		assert_fname = ( const char * ) pucFilename;
		assert_line = ( int ) ulLineNr;
		taskDISABLE_INTERRUPTS();
		while( assert_may_proceed == pdFALSE )
		{
		}
		taskENABLE_INTERRUPTS();

	}
#endif
/*-----------------------------------------------------------*/

/* Called by FreeRTOS+TCP when the network connects or disconnects.  Disconnect
events are only received if implemented in the MAC driver. */
#if( ipconfigMULTI_INTERFACE != 0 )
	void vApplicationIPNetworkEventHook( eIPCallbackEvent_t eNetworkEvent, NetworkEndPoint_t *pxEndPoint )
#else
	void vApplicationIPNetworkEventHook( eIPCallbackEvent_t eNetworkEvent )
#endif
{
static BaseType_t xTasksAlreadyCreated = pdFALSE;

	/* If the network has just come up...*/
	if( eNetworkEvent == eNetworkUp )
	{
		/* Create the tasks that use the IP stack if they have not already been
		created. */
		if( xTasksAlreadyCreated == pdFALSE )
		{
			/* Tasks that use the TCP/IP stack can be created here. */

			/* Start a new task to fetch logging lines and send them out. */
			vUDPLoggingTaskCreate();

			//bosman_open_listen_socket();

			#if( mainCREATE_TCP_ECHO_TASKS_SINGLE == 1 )
			{
				/* See http://www.freertos.org/FreeRTOS-Plus/FreeRTOS_Plus_TCP/TCP_Echo_Clients.html */
				vStartTCPEchoClientTasks_SingleTasks( configMINIMAL_STACK_SIZE * 4, tskIDLE_PRIORITY + 1 );
			}
			#endif

			#if( mainCREATE_SIMPLE_TCP_ECHO_SERVER == 1 )
			{
				/* See http://www.freertos.org/FreeRTOS-Plus/FreeRTOS_Plus_TCP/TCP_Echo_Server.html */
				vStartSimpleTCPServerTasks( configMINIMAL_STACK_SIZE * 4, tskIDLE_PRIORITY + 1 );
			}
			#endif

			/* Let the server work task 'prvServerWorkTask' now it can now create the servers. */
			xTaskNotifyGive( xServerWorkTaskHandle );

			xTasksAlreadyCreated = pdTRUE;
#if( USE_PLUS_FAT != 0 )
			doMountCard = 1;
#endif
		}

		#if( ipconfigMULTI_INTERFACE == 0 )
		{
		uint32_t ulIPAddress, ulNetMask, ulGatewayAddress, ulDNSServerAddress;
		char cBuffer[ 16 ];
			/* Print out the network configuration, which may have come from a DHCP
			server. */
			FreeRTOS_GetAddressConfiguration( &ulIPAddress, &ulNetMask, &ulGatewayAddress, &ulDNSServerAddress );
			FreeRTOS_inet_ntoa( ulIPAddress, cBuffer );
			FreeRTOS_printf( ( "IP Address: %s\n", cBuffer ) );

			FreeRTOS_inet_ntoa( ulNetMask, cBuffer );
			FreeRTOS_printf( ( "Subnet Mask: %s\n", cBuffer ) );

			FreeRTOS_inet_ntoa( ulGatewayAddress, cBuffer );
			FreeRTOS_printf( ( "Gateway Address: %s\n", cBuffer ) );

			FreeRTOS_inet_ntoa( ulDNSServerAddress, cBuffer );
			FreeRTOS_printf( ( "DNS Server Address: %s\n", cBuffer ) );
		}
		#else
		{
			/* Print out the network configuration, which may have come from a DHCP
			server. */
			showEndPoint( pxEndPoint );
		}
		#endif /* ipconfigMULTI_INTERFACE */
		//xTaskCreate( vUDPTest, "vUDPTest", mainUDP_SERVER_STACK_SIZE, NULL, mainUDP_SERVER_TASK_PRIORITY, NULL );
	}
}
/*-----------------------------------------------------------*/

#if( ipconfigMULTI_INTERFACE != 0 )
static void showEndPoint( NetworkEndPoint_t *pxEndPoint )
{
#if( ipconfigUSE_IPv6 != 0 )
	if( pxEndPoint->bits.bIPv6 )
	{
	IPv6_Address_t xPrefix;
//			pxEndPoint->ipv6_settings.xIPAddress;			/* The actual IPv4 address. Will be 0 as long as end-point is still down. */
//			pxEndPoint->ipv6_settings.uxPrefixLength;
//			pxEndPoint->ipv6_defaults.xIPAddress;
//			pxEndPoint->ipv6_settings.xGatewayAddress;
//			pxEndPoint->ipv6_settings.xDNSServerAddresses[ 2 ];	/* Not yet in use. */

		/* Extract the prefix from the IP-address */
		FreeRTOS_CreateIPv6Address( &( xPrefix ), &( pxEndPoint->ipv6_settings.xIPAddress ), pxEndPoint->ipv6_settings.uxPrefixLength, pdFALSE );

		FreeRTOS_printf( ( "IP-address : %pip\n", pxEndPoint->ipv6_settings.xIPAddress.ucBytes ) );
		if( memcmp( pxEndPoint->ipv6_defaults.xIPAddress.ucBytes, pxEndPoint->ipv6_settings.xIPAddress.ucBytes, ipSIZE_OF_IPv6_ADDRESS ) != 0 )
		{
			FreeRTOS_printf( ( "Default IP : %pip\n", pxEndPoint->ipv6_defaults.xIPAddress.ucBytes ) );
		}
		FreeRTOS_printf( ( "End-point  : up = %s\n", pxEndPoint->bits.bEndPointUp ? "yes" : "no" ) );
		FreeRTOS_printf( ( "Prefix     : %pip/%d\n", xPrefix.ucBytes, ( int ) pxEndPoint->ipv6_settings.uxPrefixLength ) );
		FreeRTOS_printf( ( "GW         : %pip\n", pxEndPoint->ipv6_settings.xGatewayAddress.ucBytes ) );
		FreeRTOS_printf( ( "DNS        : %pip\n", pxEndPoint->ipv6_settings.xDNSServerAddresses[ 0 ].ucBytes ) );
	}
	else
#endif	/* ( ipconfigUSE_IPv6 != 0 ) */
	{
		FreeRTOS_printf( ( "IP-address : %lxip\n",
			FreeRTOS_ntohl( pxEndPoint->ipv4_settings.ulIPAddress ) ) );
		if( pxEndPoint->ipv4_settings.ulIPAddress != pxEndPoint->ipv4_defaults.ulIPAddress )
		{
			FreeRTOS_printf( ( "Default IP : %lxip\n", FreeRTOS_ntohl( pxEndPoint->ipv4_defaults.ulIPAddress ) ) );
		}
		int bWantDHCP;
		#if( ipconfigUSE_DHCP != 0 )
			bWantDHCP = pxEndPoint->bits.bWantDHCP;
		#else
			bWantDHCP = 0;
		#endif
		
		FreeRTOS_printf( ( "End-point  : up = %s dhcp = %d\n",
			pxEndPoint->bits.bEndPointUp ? "yes" : "no",
			bWantDHCP ) );
		FreeRTOS_printf( ( "Net mask   : %lxip\n", FreeRTOS_ntohl( pxEndPoint->ipv4_settings.ulNetMask ) ) );
		FreeRTOS_printf( ( "GW         : %lxip\n", FreeRTOS_ntohl( pxEndPoint->ipv4_settings.ulGatewayAddress ) ) );
		FreeRTOS_printf( ( "DNS        : %lxip\n", FreeRTOS_ntohl( pxEndPoint->ipv4_settings.ulDNSServerAddresses[ 0 ] ) ) );
		FreeRTOS_printf( ( "Broadcast  : %lxip\n", FreeRTOS_ntohl( pxEndPoint->ipv4_settings.ulBroadcastAddress ) ) );
	}

	FreeRTOS_printf( ( "MAC address: %02x-%02x-%02x-%02x-%02x-%02x\n",
		pxEndPoint->xMACAddress.ucBytes[ 0 ],
		pxEndPoint->xMACAddress.ucBytes[ 1 ],
		pxEndPoint->xMACAddress.ucBytes[ 2 ],
		pxEndPoint->xMACAddress.ucBytes[ 3 ],
		pxEndPoint->xMACAddress.ucBytes[ 4 ],
		pxEndPoint->xMACAddress.ucBytes[ 5 ] ) );
	FreeRTOS_printf( ( " \n" ) );
}
#endif	/* ipconfigMULTI_INTERFACE */
/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
	/* Called if a call to pvPortMalloc() fails because there is insufficient
	free memory available in the FreeRTOS heap.  pvPortMalloc() is called
	internally by FreeRTOS API functions that create tasks, queues, software
	timers, and semaphores.  The size of the FreeRTOS heap is set by the
	configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h. */

	/* Force an assert. */
	configASSERT( ( volatile void * ) NULL );
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
	( void ) pcTaskName;
	( void ) pxTask;

	/* Run time stack overflow checking is performed if
	configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
	function is called if a stack overflow is detected. */

	/* Force an assert. */
	configASSERT( ( volatile void * ) NULL );
}
/*-----------------------------------------------------------*/

static UBaseType_t uxRand16( void )
{
const uint32_t ulMultiplier = 0x015a4e35UL, ulIncrement = 1UL;

	/* Utility function to generate a pseudo random number. */

