htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
	ulNextRand = ( ulMultiplier * ulNextRand ) + ulIncrement;
	return( ( int ) ( ulNextRand >> 16UL ) & 0x7fffuL );
}
/*-----------------------------------------------------------*/

UBaseType_t uxRand( void )
{
uint32_t ulResult;
	if( xRandom32( &ulResult ) == pdFAIL )
	{
		do {
			UBaseType_t v1 = uxRand16() & 0x7fffuL;
			UBaseType_t v2 = uxRand16() & 0x7fffuL;
			UBaseType_t v3 = uxRand16() & 0x03;
			ulResult = v1 | ( v2 << 15 ) | ( v3 << 30 );
		} while( ulResult == 0uL );
	}
	return ulResult;
}
/*-----------------------------------------------------------*/

static void prvSRand( UBaseType_t ulSeed )
{
	/* Utility function to seed the pseudo random number generator. */
	ulNextRand = ulSeed;
}
/*-----------------------------------------------------------*/

#if( ipconfigMULTI_INTERFACE != 0 )
	extern BaseType_t xApplicationDNSQueryHook( NetworkEndPoint_t *pxEndPoint, const char *pcName );
#else
	extern BaseType_t xApplicationDNSQueryHook( const char *pcName );
#endif

void vApplicationPingReplyHook( ePingReplyStatus_t eStatus, uint16_t usIdentifier )
{
	if (xPing4Count >= 0 && xPing4Count < PING_COUNT_MAX) {
		xPing4Count++;
		if (pingLogging || xPing4Count == PING_COUNT_MAX)
			FreeRTOS_printf( ( "Received reply %d: status %d ID %04x\n", ( int ) xPing4Count, ( int ) eStatus, usIdentifier ) );
	}
#if( ipconfigUSE_IPv6 != 0 )
	if (xPing6Count >= 0 && xPing6Count < PING_COUNT_MAX) {
		xPing6Count++;
		//if (xPing6Count == PING_COUNT_MAX || xPing6Count == 1)
			FreeRTOS_printf( ( "Received reply %d: status %d ID %04x\n", ( int ) xPing6Count, ( int ) eStatus, usIdentifier ) );
	}
#endif
	xPingReady = pdTRUE;

	if( xServerSemaphore != NULL )
	{
		xSemaphoreGive( xServerSemaphore );
	}
}
/*-----------------------------------------------------------*/

/* These are volatile to try and prevent the compiler/linker optimising them
away as the variables never actually get used.  If the debugger won't show the
values of the variables, make them global my moving their declaration outside
of this function. */
volatile uint32_t r0;
volatile uint32_t r1;
volatile uint32_t r2;
volatile uint32_t r3;
volatile uint32_t r12;
volatile uint32_t lr; /* Link register. */
volatile uint32_t pc; /* Program counter. */
volatile uint32_t psr;/* Program status register. */

struct xREGISTER_STACK {
	uint32_t spare0[ 8 ];
	uint32_t r0;
	uint32_t r1;
	uint32_t r2;
	uint32_t r3;
	uint32_t r12;
	uint32_t lr; /* Link register. */
	uint32_t pc; /* Program counter. */
	uint32_t psr;/* Program status register. */
	uint32_t spare1[ 8 ];
};

volatile struct xREGISTER_STACK *pxRegisterStack = NULL;

void prvGetRegistersFromStack( uint32_t *pulFaultStackAddress )
{
	pxRegisterStack = ( struct xREGISTER_STACK *) ( pulFaultStackAddress - ARRAY_SIZE( pxRegisterStack->spare0 ) );
	r0 = pulFaultStackAddress[ 0 ];
	r1 = pulFaultStackAddress[ 1 ];
	r2 = pulFaultStackAddress[ 2 ];
	r3 = pulFaultStackAddress[ 3 ];

	r12 = pulFaultStackAddress[ 4 ];
	lr = pulFaultStackAddress[ 5 ];
	pc = pulFaultStackAddress[ 6 ];
	psr = pulFaultStackAddress[ 7 ];

	/* When the following line is hit, the variables contain the register values. */
	for( ;; );
}
/*-----------------------------------------------------------*/

//void HardFault_Handler( void ) __attribute__( ( naked ) );
void HardFault_Handler(void)
{
	__asm volatile
	(
		" tst lr, #4                                                \n"
		" ite eq                                                    \n"
		" mrseq r0, msp                                             \n"
		" mrsne r0, psp                                             \n"
		" ldr r1, [r0, #24]                                         \n"
		" bl prvGetRegistersFromStack                               \n"
	);
}
/*-----------------------------------------------------------*/

#if defined(__IAR_SYSTEMS_ICC__)
	uint8_t heapMemory[100000];
	
	#define HEAP_START		heapMemory[0]
	#define HEAP_END		heapMemory[sizeof heapMemory]
#else
	extern uint8_t __bss_end__, _estack, _Min_Stack_Size;
	#define HEAP_START		__bss_end__
	#define HEAP_END		_estack
#endif

volatile uint32_t ulHeapSize;
volatile uint8_t *pucHeapStart;

static void heapInit( )
{
uint32_t ulStackSize = (uint32_t)&(_Min_Stack_Size);

	pucHeapStart = ( uint8_t * ) ( ( ( ( uint32_t ) &HEAP_START ) + 7 ) & ~0x07ul );

	ulHeapSize = ( uint32_t ) ( &HEAP_END - &HEAP_START );
	ulHeapSize &= ~0x07ul;
	ulHeapSize -= ulStackSize;

	HeapRegion_t xHeapRegions[] = {
		{ ( unsigned char *) pucHeapStart, ulHeapSize },
		{ NULL, 0 }
 	};

	vPortDefineHeapRegions( xHeapRegions );
}
/*-----------------------------------------------------------*/

/* In some cases, a library call will use malloc()/free(),
redefine them to use pvPortMalloc()/vPortFree(). */

void *malloc(size_t size)
{
	return pvPortMalloc(size);
}
/*-----------------------------------------------------------*/

void free(void *ptr)
{
	vPortFree(ptr);
}
/*-----------------------------------------------------------*/

extern void vOutputChar( const char cChar, const TickType_t xTicksToWait  );

void vOutputChar( const char cChar, const TickType_t xTicksToWait  )
{
	( void ) cChar;
	( void ) xTicksToWait;
}
/*-----------------------------------------------------------*/

BaseType_t xApplicationMemoryPermissions( uint32_t aAddress )
{
	( void ) aAddress;
	return 3;
}
/*-----------------------------------------------------------*/

const char *pcApplicationHostnameHook( void )
{
	/* Assign the name "FreeRTOS" to this network node.  This function will be
	called during the DHCP: the machine will be registered with an IP address
	plus this name. */
	return mainHOST_NAME;
}
/*-----------------------------------------------------------*/


#if( ipconfigMULTI_INTERFACE != 0 )
#warning Multi
	BaseType_t xApplicationDNSQueryHook( NetworkEndPoint_t *pxEndPoint, const char *pcName )
#else
#warning Single
	BaseType_t xApplicationDNSQueryHook( const char *pcName )
#endif
{
BaseType_t xReturn;

	/* Determine if a name lookup is for this node.  Two names are given
	to this node: that returned by pcApplicationHostnameHook() and that set
	by mainDEVICE_NICK_NAME. */
	if( strcasecmp( pcName, pcApplicationHostnameHook() ) == 0 )
	{
		xReturn = pdPASS;
	}
	else if( strcasecmp( pcName, mainDEVICE_NICK_NAME ) == 0 )
	{
		xReturn = pdPASS;
	}
	else if( strcasecmp( pcName, "hs2011" ) == 0 )
	{
		xReturn = pdPASS;
	}
	else if( strncasecmp( pcName, "aap", 3 ) == 0 )
	{
#if( ipconfigUSE_IPv6 != 0 )
		xReturn = pxEndPoint->bits.bIPv6 != 0;
#else
		xReturn = pdPASS;
#endif
	}
	else if( strncasecmp( pcName, "kat", 3 ) == 0 )
	{
#if( ipconfigUSE_IPv6 != 0 )
		xReturn = pxEndPoint->bits.bIPv6 == 0;
		unsigned number = 0;
		if( sscanf( pcName + 3, "%u", &number) > 0 )
		{
			if( number == 172 )
			{
				pxEndPoint->ipv4_settings.ulIPAddress = FreeRTOS_inet_addr_quick( 172,  16,   0, 114 );
			}
			else
			if( number == 192 )
			{
			NetworkEndPoint_t *px;

