htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
				for( px = FreeRTOS_FirstEndPoint( NULL );
					px != NULL;
					px = FreeRTOS_NextEndPoint( NULL, px ) )
				{
					if( px->bits.bIPv6 == pdFALSE_UNSIGNED )
					{
						break;
					}
				}
				if( px != NULL )
				{
					pxEndPoint->ipv4_settings.ulIPAddress = px->ipv4_settings.ulIPAddress;
				}
				else
				{
					pxEndPoint->ipv4_settings.ulIPAddress = FreeRTOS_inet_addr_quick( 192,  168,   2, 114 );
				}
			}
		}
#else
		xReturn = pdPASS;
#endif
	}
	else
	{
		xReturn = pdFAIL;
	}
	#if( ipconfigUSE_IPv6 != 0 )
	{
		if( ( allowIPVersion & eIPv4 ) == 0 && !pxEndPoint->bits.bIPv6 )
		{
			xReturn = pdFAIL;
		}
		if( ( allowIPVersion & eIPv6 ) == 0 && pxEndPoint->bits.bIPv6 )
		{
			xReturn = pdFAIL;
		}
	}
	#endif	/* ipconfigUSE_IPv6 */
#if( ipconfigMULTI_INTERFACE != 0 ) && ( ipconfigUSE_IPv6 != 0 )
	FreeRTOS_printf( ( "LLMNR query '%s' = %d IPv%c\n", pcName, (int)xReturn, pxEndPoint->bits.bIPv6 ? '6' : '4' ) );
#else
	FreeRTOS_printf( ( "LLMNR query '%s' = %d IPv4 only\n", pcName, (int)xReturn ) );
#endif

	return xReturn;
}
/*-----------------------------------------------------------*/

//static uint32_t ulListTime;
static uint64_t ullHiresTime;
uint32_t ulGetRunTimeCounterValue( void )
{
	return ( uint32_t ) ( ullGetHighResolutionTime() - ullHiresTime );
}

extern BaseType_t xTaskClearCounters;
void vShowTaskTable( BaseType_t aDoClear )
{
TaskStatus_t *pxTaskStatusArray;
volatile UBaseType_t uxArraySize, x;
uint64_t ullTotalRunTime;
uint32_t ulStatsAsPermille;
uint32_t ulStackSize;

	// Take a snapshot of the number of tasks in case it changes while this
	// function is executing.
	uxArraySize = uxTaskGetNumberOfTasks();

	// Allocate a TaskStatus_t structure for each task.  An array could be
	// allocated statically at compile time.
	pxTaskStatusArray = pvPortMalloc( uxArraySize * sizeof( TaskStatus_t ) );

	FreeRTOS_printf( ( "Task name    Prio    Stack    Time(uS) Perc \n" ) );

	if( pxTaskStatusArray != NULL )
	{
		// Generate raw status information about each task.
		uint32_t ulDummy;
		xTaskClearCounters = aDoClear;
		uxArraySize = uxTaskGetSystemState( pxTaskStatusArray, uxArraySize, &ulDummy );

		ullTotalRunTime = ullGetHighResolutionTime() - ullHiresTime;

		// For percentage calculations.
		ullTotalRunTime /= 1000UL;

		// Avoid divide by zero errors.
		if( ullTotalRunTime > 0ull )
		{
			// For each populated position in the pxTaskStatusArray array,
			// format the raw data as human readable ASCII data
			for( x = 0; x < uxArraySize; x++ )
			{
				// What percentage of the total run time has the task used?
				// This will always be rounded down to the nearest integer.
				// ulTotalRunTimeDiv100 has already been divided by 100.
				ulStatsAsPermille = pxTaskStatusArray[ x ].ulRunTimeCounter / ullTotalRunTime;

				FreeRTOS_printf( ( "%-14.14s %2lu %8u %8lu  %3lu.%lu %%\n",
					pxTaskStatusArray[ x ].pcTaskName,
					pxTaskStatusArray[ x ].uxCurrentPriority,
					pxTaskStatusArray[ x ].usStackHighWaterMark,
					pxTaskStatusArray[ x ].ulRunTimeCounter,
					ulStatsAsPermille / 10,
					ulStatsAsPermille % 10) );
			}
		}

		// The array is no longer needed, free the memory it consumes.
		vPortFree( pxTaskStatusArray );
	}
	ulStackSize = (uint32_t)&(_Min_Stack_Size);
	FreeRTOS_printf( ( "Heap: min/cur/max: %lu %lu %lu stack %lu\n",
			( uint32_t )xPortGetMinimumEverFreeHeapSize(),
			( uint32_t )xPortGetFreeHeapSize(),
			( uint32_t )ulHeapSize,
			( uint32_t )ulStackSize ) );
	if( aDoClear != pdFALSE )
	{
//		ulListTime = xTaskGetTickCount();
		ullHiresTime = ullGetHighResolutionTime();
	}
}
/*-----------------------------------------------------------*/

#define MEMCPY_SIZE   2048

/*
2015-02-25 14:26:56.532 1:18:21    3.428.000 [IP-task   ] Copy internal 12679 external 8347

12679 * 2048 * 10 = 259,665,920
 8347 * 2048 * 10 = 170,946,560
 259,665,920 / 168000000 = 1.5456304761904761904761904761905
*/


#if defined ( __GNUC__ ) /*!< GCC Compiler */

	volatile int unknown_calls = 0;

	struct timeval;

	int _gettimeofday (struct timeval *pcTimeValue, void *pvTimeZone)
	{
		unknown_calls++;

		return 0;
	}
	/*-----------------------------------------------------------*/

	#if GNUC_NEED_SBRK
		void *_sbrk( ptrdiff_t __incr)
		{
			unknown_calls++;
	
			return 0;
		}
		/*-----------------------------------------------------------*/
	#endif
#endif
/*-----------------------------------------------------------*/

#ifndef SRAM1_BASE
	#define SRAM1_BASE            ((uint32_t)0x20000000) /*!< SRAM1(112 KB) base address in the alias region                             */
#endif
#ifndef SRAM2_BASE
	#define SRAM2_BASE            ((uint32_t)0x2001C000) /*!< SRAM2(16 KB) base address in the alias region                              */
#endif
#ifndef SRAM3_BASE
	#define SRAM3_BASE            ((uint32_t)0x20020000) /*!< SRAM3(64 KB) base address in the alias region                              */
#endif

typedef struct xMemoryArea {
	uint32_t ulStart;
	uint32_t ulSize;
} MemoryArea_t;

#define	sizeKB		1024ul

MemoryArea_t xMemoryAreas[] = {
	{ ulStart : SRAM1_BASE, ulSize : 112 * sizeKB },
	{ ulStart : SRAM2_BASE, ulSize : 16 * sizeKB },
	{ ulStart : SRAM3_BASE, ulSize : 64 * sizeKB },
};

static volatile int errors[ 3 ] = { 0, 0, 0 };
/*
static void memory_tests()
{
	int index;
	char buffer[ 16 ];
	for( index = 0; index < ARRAY_SIZE(xMemoryAreas); index++ )
	{
	int offset;
	unsigned char *source = ( unsigned char * ) ( xMemoryAreas[ index ].ulStart + 8192 );

		for( offset = 0; offset < sizeof( buffer ); offset++ )
		{
			buffer[ offset ] = source[ offset ];
		}
		for( offset = 0; offset < sizeof( buffer ); offset++ )
		{
			source[ offset ] = buffer[ offset ] + 1;
		}
		for( offset = 0; offset < sizeof( buffer ); offset++ )
		{
			if( source[ offset ] != buffer[ offset ] + 1 )
			{
				errors[ index ]++;
			}
		}
		// Restore original contents.
		for( offset = 0; offset < sizeof( buffer ); offset++ )
		{
			source[ offset ] = buffer[ offset ];
		}
	}
}
*/

/* Add legacy definition */
#define  GPIO_Speed_2MHz    GPIO_SPEED_LOW
#define  GPIO_Speed_25MHz   GPIO_SPEED_MEDIUM
#define  GPIO_Speed_50MHz   GPIO_SPEED_FAST
#define  GPIO_Speed_100MHz  GPIO_SPEED_HIGH

/*_HT_ Please consider keeping the function below called HAL_ETH_MspInit().
It will be called from "stm32f4xx_hal_eth.c".
It is defined there as weak only.
My board didn't work without the settings made below.
*/
/* This is a callback function. */

void HAL_ETH_MspInit( ETH_HandleTypeDef* heth )
{
	GPIO_InitTypeDef GPIO_InitStruct;

	if( heth->Instance == ETH )
	{
		__ETH_CLK_ENABLE();			/* defined as __HAL_RCC_ETH_CLK_ENABLE. */
		__ETHMACRX_CLK_ENABLE();	/* defined as __HAL_RCC_ETHMACRX_CLK_ENABLE. */
		__ETHMACTX_CLK_ENABLE();	/* defined as __HAL_RCC_ETHMACTX_CLK_ENABLE. */

	/* Enable GPIOs clocks */
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB |
//						   RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOI |
//						   RCC_AHB1Periph_GPIOG | RCC_AHB1Periph_GPIOH |
//						   RCC_AHB1Periph_GPIOD | RCC_AHB1Periph_GPIOE |
//						   RCC_AHB1Periph_GPIOF, ENABLE);

//	/* Enable SYSCFG clock */
//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

