htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
	/* Configure MCO (PA8) */
	GPIO_InitStruct.Pin = GPIO_PIN_8;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF11_ETH;//GPIO_AF0_MCO;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/* MII/RMII Media interface selection --------------------------------------*/
	#if( ipconfigUSE_RMII != 0 )
		/* Mode RMII with STM324xx-EVAL */
		//SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_RMII);
	#else
		/* Mode MII with STM324xx-EVAL  */
		#ifdef PHY_CLOCK_MCO
			/* Output HSE clock (25MHz) on MCO pin (PA8) to clock the PHY */
			RCC_MCO1Config(RCC_MCO1Source_HSE, RCC_MCO1Div_1);
		#endif /* PHY_CLOCK_MCO */
		//SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_MII);
	#endif

	/* Ethernet pins configuration ************************************************/
	/*
										STM3240G-EVAL
										DP83848CVV	LAN8720
	ETH_MDIO -------------------------> PA2		==	PA2
	ETH_MDC --------------------------> PC1		==	PC1
	ETH_PPS_OUT ----------------------> PB5			x
	ETH_MII_CRS ----------------------> PH2			x
	ETH_MII_COL ----------------------> PH3			x
	ETH_MII_RX_ER --------------------> PI10		x
	ETH_MII_RXD2 ---------------------> PH6			x
	ETH_MII_RXD3 ---------------------> PH7			x
	ETH_MII_TX_CLK -------------------> PC3			x
	ETH_MII_TXD2 ---------------------> PC2			x
	ETH_MII_TXD3 ---------------------> PB8			x
	ETH_MII_RX_CLK/ETH_RMII_REF_CLK---> PA1		==	PA1
	ETH_MII_RX_DV/ETH_RMII_CRS_DV ----> PA7		==	PA7
	ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4		==	PC4
	ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5		==	PC5
	ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PG11	<>	PB11
	ETH_MII_TXD0/ETH_RMII_TXD0 -------> PG13	<>	PB12
	ETH_MII_TXD1/ETH_RMII_TXD1 -------> PG14	<>	PB13
	*/

	/* Configure PA1, PA2 and PA7 */
	GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	#if( USE_STM324xG_EVAL != 0 )
	{
		/* Configure PB5 and PB8 */
		GPIO_InitStruct.Pin = GPIO_PIN_5 | GPIO_PIN_8;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

		/* Configure PC1, PC2, PC3, PC4 and PC5 */
		GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	}
	#else
	{
		/* Configure PC1, PC4 and PC5 */
		GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	}
	#endif /* USE_STM324xG_EVAL */


	/* Configure PC1, PC2, PC3, PC4 and PC5 */
	#if( USE_STM324xG_EVAL != 0 )
	{
		/* Configure PG11, PG13 and PG14 */
		GPIO_InitStruct.Pin =  GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

		/* Configure PH2, PH3, PH6, PH7 */
		GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_6 | GPIO_PIN_7;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

		/* Configure PI10 */
		GPIO_InitStruct.Pin = GPIO_PIN_10;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);
	}
	#else
	{
		/* Configure PB11, PB12 and PB13 */
		GPIO_InitStruct.Pin =  GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
	}
	#endif /* USE_STM324xG_EVAL */
	HAL_NVIC_SetPriority( ETH_IRQn, ipconfigMAC_INTERRUPT_PRIORITY, 0 );
	HAL_NVIC_EnableIRQ( ETH_IRQn );
	} // if( heth->Instance == ETH )
}
/*-----------------------------------------------------------*/

uint32_t ulApplicationGetNextSequenceNumber(
    uint32_t ulSourceAddress,
    uint16_t usSourcePort,
    uint32_t ulDestinationAddress,
    uint16_t usDestinationPort )
{
	return ipconfigRAND32();
}

static uint8_t msg_1[] = {
	0x54, 0x55, 0x58, 0x10, 0x00, 0x37, 0x00, 0xe0,   0x4c, 0x36, 0x01, 0x3b, 0x08, 0x00, 0x45, 0x00,
	0x00, 0x34, 0x49, 0xa7, 0x40, 0x00, 0x80, 0x06,   0x00, 0x00, 0xc0, 0xa8, 0x01, 0x0a, 0xc0, 0xa8,
	0x01, 0x05, 0xd6, 0xc5, 0x27, 0x10, 0x0c, 0x5b,   0xa2, 0x4b, 0x00, 0x00, 0x00, 0x00, 0x80, 0x02,
	0xfa, 0xf0, 0x83, 0x86, 0x00, 0x00, 0x02, 0x04,   0x05, 0xb4, 0x01, 0x03, 0x03, 0x08, 0x01, 0x01,
	0x04, 0x02
};

static uint8_t msg_2[] = {
	0x00, 0xe0, 0x4c, 0x36, 0x01, 0x3b, 0x54, 0x55,   0x58, 0x10, 0x00, 0x37, 0x08, 0x00, 0x45, 0x00,
	0x00, 0x2c, 0x00, 0x04, 0x00, 0x00, 0x80, 0x06,   0x2d, 0xbd, 0xc0, 0xa8, 0x01, 0x05, 0xc0, 0xa8,
	0x01, 0x0a, 0x27, 0x10, 0xd6, 0xc5, 0x29, 0xac,   0xd1, 0x2d, 0x0c, 0x5b, 0xa2, 0x4c, 0x60, 0x12,
	0x05, 0x78, 0x44, 0x43, 0x00, 0x00, 0x02, 0x04,   0x05, 0x78, 0x00, 0x00
};

static uint8_t msg_3[] = {
	0x54, 0x55, 0x58, 0x10, 0x00, 0x37, 0x00, 0xe0,   0x4c, 0x36, 0x01, 0x3b, 0x08, 0x00, 0x45, 0x00,
	0x00, 0x34, 0x49, 0xa8, 0x40, 0x00, 0x80, 0x06,   0x00, 0x00, 0xc0, 0xa8, 0x01, 0x0a, 0xc0, 0xa8,
	0x01, 0x05, 0xd6, 0xc5, 0x27, 0x10, 0x0c, 0x5b,   0xa2, 0x4b, 0x00, 0x00, 0x00, 0x00, 0x80, 0x02,
	0xfa, 0xf0, 0x83, 0x86, 0x00, 0x00, 0x02, 0x04,   0x05, 0xb4, 0x01, 0x03, 0x03, 0x08, 0x01, 0x01,
	0x04, 0x02
};

static uint8_t msg_4[] = {
	0x00, 0xe0, 0x4c, 0x36, 0x01, 0x3b, 0x54, 0x55,   0x58, 0x10, 0x00, 0x37, 0x08, 0x00, 0x45, 0x00,
	0x00, 0x2c, 0x00, 0x05, 0x00, 0x00, 0x80, 0x06,   0x2d, 0xbc, 0xc0, 0xa8, 0x01, 0x05, 0xc0, 0xa8,
	0x01, 0x0a, 0x27, 0x10, 0xd6, 0xc5, 0x29, 0xac,   0xd1, 0x2d, 0x0c, 0x5b, 0xa2, 0x4c, 0x60, 0x12,
	0x05, 0x78, 0x44, 0x43, 0x00, 0x00, 0x02, 0x04,   0x05, 0x78, 0x00, 0x00
};

