htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
struct SPacket {
	uint8_t *pucData;
	BaseType_t xCount;
};

const struct SPacket packets[] = {
	{ msg_1, sizeof msg_1 },
	{ msg_2, sizeof msg_2 },
	{ msg_3, sizeof msg_3 },
	{ msg_4, sizeof msg_4 },
};

uint16_t usGenerateProtocolChecksum( const uint8_t * const pucEthernetBuffer, size_t uxBufferLength, BaseType_t xOutgoingPacket );

static void checksum_test()
{
	int i;
	for (i = 0; i < ARRAY_SIZE(packets); i++) {
		uint16_t usChecksum_IP, usChecksum_TCP, usChecksum_IP_2, usChecksum_TCP_2;
		IPHeader_t *pxIPHeader_IPv4;
		ProtocolHeaders_t *pxProtocolHeaders;
		int count = packets[i].xCount;
		BaseType_t xIPHeaderLength;
		const uint8_t *pucEthernetBuffer = packets[i].pucData;
	
		pxIPHeader_IPv4 = ipPOINTER_CAST( IPHeader_t *, &( pucEthernetBuffer[ ipSIZE_OF_ETH_HEADER ] ) );
		xIPHeaderLength = sizeof( uint32_t ) * ( pxIPHeader_IPv4->ucVersionHeaderLength & 0x0F );
		pxProtocolHeaders = ( ProtocolHeaders_t * ) ( pucEthernetBuffer + ipSIZE_OF_ETH_HEADER + xIPHeaderLength );

		usChecksum_IP = pxIPHeader_IPv4->usHeaderChecksum;
		usChecksum_TCP = pxProtocolHeaders->xTCPHeader.usChecksum;

		pxIPHeader_IPv4->usHeaderChecksum = 0x00u;
		pxIPHeader_IPv4->usHeaderChecksum = usGenerateChecksum( 0u, ( uint8_t * ) &( pxIPHeader_IPv4->ucVersionHeaderLength ), xIPHeaderLength );
		pxIPHeader_IPv4->usHeaderChecksum = ~FreeRTOS_htons( pxIPHeader_IPv4->usHeaderChecksum );

		usChecksum_IP_2 = pxIPHeader_IPv4->usHeaderChecksum;

//		pxIPHeader_IPv4->usHeaderChecksum = 0;
//		pxProtocolHeaders->xTCPHeader.usChecksum = 0;

		usGenerateProtocolChecksum (pucEthernetBuffer, count, pdTRUE );

		usChecksum_TCP_2 = pxProtocolHeaders->xTCPHeader.usChecksum;

		FreeRTOS_printf( ( "Checksum %d  %d + %d + %d = %d ( %04x -> %04x ) %04x -> %04x\n",
			i,

			( int ) ipSIZE_OF_ETH_HEADER,
			( int ) xIPHeaderLength,
			( int ) ( FreeRTOS_ntohs( pxIPHeader_IPv4->usLength ) - xIPHeaderLength ),
			( int ) count,

			FreeRTOS_ntohs( usChecksum_IP ),
			FreeRTOS_ntohs( usChecksum_IP_2 ),
			FreeRTOS_ntohs( usChecksum_TCP ),
			FreeRTOS_ntohs( usChecksum_TCP_2 ) ) );
	}
}

#if( ipconfigUSE_CALLBACKS != 0 )
static BaseType_t xOnUdpReceive( Socket_t xSocket, void * pvData, size_t xLength,
	const struct freertos_sockaddr *pxFrom, const struct freertos_sockaddr *pxDest )
{
#if( ipconfigUSE_IPv6 != 0 )
const struct freertos_sockaddr6 *pxFrom6 = ( const struct freertos_sockaddr6 * ) pxFrom;
const struct freertos_sockaddr6 *pxDest6 = ( const struct freertos_sockaddr6 * ) pxDest;
#endif
	#if( ipconfigUSE_IPv6 != 0 )
	if( pxFrom6->sin_family == FREERTOS_AF_INET6 )
	{
		FreeRTOS_printf( ( "xOnUdpReceive_6: %d bytes\n",  ( int ) xLength ) );
		FreeRTOS_printf( ( "xOnUdpReceive_6: from %pip\n", pxFrom6->sin_addrv6.ucBytes ) );
		FreeRTOS_printf( ( "xOnUdpReceive_6: to   %pip\n", pxDest6->sin_addrv6.ucBytes ) );
	}
	else
	#endif
	{
		FreeRTOS_printf( ( "xOnUdpReceive_4: %d bytes\n", ( int ) xLength ) );
		FreeRTOS_printf( ( "xOnUdpReceive_4: from %lxip\n", FreeRTOS_ntohl( pxFrom->sin_addr ) ) );
		FreeRTOS_printf( ( "xOnUdpReceive_4: to   %lxip\n", FreeRTOS_ntohl( pxDest->sin_addr ) ) );
		
	}
	/* Returning 0 means: not yet consumed. */
	return 0;
}
#endif

static volatile BaseType_t xDNSCount = 0;
#if( ipconfigUSE_IPv6 != 0 )
	void onDNSEvent( const char * pcName, void *pvSearchID, struct freertos_sockaddr6 *pxAddress6 )
	{
		if( pxAddress6->sin_family == FREERTOS_AF_INET6 )
		{
		BaseType_t xIsEmpty = pdTRUE, xIndex;

			for( xIndex = 0; xIndex < ( BaseType_t ) ARRAY_SIZE( pxAddress6->sin_addrv6.ucBytes ); xIndex++ )
			{
				if( pxAddress6->sin_addrv6.ucBytes[ xIndex ] != ( uint8_t ) 0u )
				{
					xIsEmpty = pdFALSE;
					break;
				}
			}
			if( xIsEmpty )
			{
				FreeRTOS_printf( ( "onDNSEvent/v6: '%s' timed out\n", pcName ) );
			}
			else
			{
				FreeRTOS_printf( ( "onDNSEvent/v6: found '%s' on %pip\n", pcName, pxAddress6->sin_addrv6.ucBytes ) );
			}
		}
		else
		{
		struct freertos_sockaddr *pxAddress4 = ( struct freertos_sockaddr * ) pxAddress6;

			if( pxAddress4->sin_addr == 0uL )
			{
				FreeRTOS_printf( ( "onDNSEvent/v4: '%s' timed out\n", pcName ) );
			}
			else
			{
				FreeRTOS_printf( ( "onDNSEvent/v4: found '%s' on %lxip\n", pcName, FreeRTOS_ntohl( pxAddress4->sin_addr ) ) );
			}
		}
		if( xServerWorkTaskHandle != NULL )
		{
			xDNSCount++;
			xTaskNotifyGive( xServerWorkTaskHandle );
		}
	}
#else
	void onDNSEvent( const char * pcName, void *pvSearchID, uint32_t ulIPAddress )
	{
		FreeRTOS_printf( ( "onDNSEvent: found '%s' on %lxip\n", pcName, FreeRTOS_ntohl( ulIPAddress ) ) );
		if( xServerWorkTaskHandle != NULL )
		{
			xDNSCount++;
			xTaskNotifyGive( xServerWorkTaskHandle );
		}
	}
#endif

static struct freertos_addrinfo *pxDNSLookup( char *pcHost, BaseType_t xIPVersion, BaseType_t xDoClear )
{
#if( ipconfigMULTI_INTERFACE != 0 )
	struct freertos_addrinfo *pxResult = NULL;
	struct freertos_addrinfo xHints;

	if( xIPVersion == 4 )
	{
		xHints.ai_family = FREERTOS_AF_INET;
	}
	else
	{
		xHints.ai_family = FREERTOS_AF_INET6;
	}
#endif

	if( xDoClear )
	{
		#if( ipconfigUSE_DNS_CACHE != 0 )
		{
			FreeRTOS_dnsclear();
		}
		#endif /* ipconfigUSE_DNS_CACHE */
		#if( ipconfigMULTI_INTERFACE != 0 )
			FreeRTOS_ClearARP( NULL );
		#else
			FreeRTOS_ClearARP();
		#endif
	}
	xDNSCount = 0;
#if( ipconfigMULTI_INTERFACE != 0 )

	#if( ipconfigDNS_USE_CALLBACKS != 0 )
		void *pvSearchID = ( void *)ipconfigRAND32();
		uint32_t ulIPAddress = FreeRTOS_getaddrinfo_a(
			pcHost,		/* The node. */
			NULL,		/* const char *pcService: ignored for now. */
			&xHints,	/* If not NULL: preferences. */
			&pxResult,	/* An allocated struct, containing the results. */
			onDNSEvent,
			pvSearchID,
			5000);

		FreeRTOS_printf( ( "dns query%d: '%s' = %lxip\n", ( int ) xIPVersion, pcHost, ulIPAddress ) );
	#else
		BaseType_t xResult = FreeRTOS_getaddrinfo(
			pcHost,			/* The node. */
			NULL,			/* const char *pcService: ignored for now. */
			&xHints,		/* If not NULL: preferences. */
			&pxResult );	/* An allocated struct, containing the results. */
		if( xResult != 0 )
		{
			FreeRTOS_printf( ( "dns query%d: '%s' No results\n", ( int ) xIPVersion, pcHost ) );
		}
		else
		{
		#if( ipconfigUSE_IPv6 != 0 )
			if( xIPVersion == 6 )
			{
			struct freertos_sockaddr6 *pxAddr6;
				pxAddr6 = ( struct freertos_sockaddr6 * ) pxResult->ai_addr;

