htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
				FreeRTOS_printf( ( "dns query%d: '%s' = %pip rc = %lu\n", ( int ) xIPVersion, pcHost, pxAddr6->sin_addrv6.ucBytes, xResult ) );
			}
			else
		#endif	/* ipconfigUSE_IPv6 */
			{
				FreeRTOS_printf( ( "dns query%d: '%s' = %lxip rc = %lu\n", ( int ) xIPVersion, pcHost, FreeRTOS_ntohl( pxResult->ai_addr->sin_addr ), xResult ) );
			}
		}
	#endif	/* ipconfigDNS_USE_CALLBACKS */
#endif	/* ipconfigMULTI_INTERFACE */

#if( ipconfigDNS_USE_CALLBACKS != 0 ) && ( ipconfigMULTI_INTERFACE != 0 )
	if( pxResult == NULL )
	{
	#if( ipconfigUSE_IPv6 != 0 )
		IPv6_Address_t xAddress_IPv6;
	#endif /* ( ipconfigUSE_IPv6 != 0 ) */
		uint32_t ulIpAddress;
		int iCount;
		for( iCount = 0; iCount < 10; iCount++ )
		{
			ulTaskNotifyTake( pdTRUE, 1000 );
			if( xDNSCount != 0 )
			{
				break;
			}
		}
		vTaskDelay( 333 );
		pxResult = ipPOINTER_CAST( struct freertos_addrinfo *, pvPortMalloc( sizeof( *pxResult ) ) );
		if( pxResult != NULL )
		{
			memset( pxResult, '\0', sizeof( *pxResult ) );
			pxResult->ai_canonname = pxResult->xPrivateStorage.ucName;
			strncpy( pxResult->xPrivateStorage.ucName, pcHost, sizeof( pxResult->xPrivateStorage.ucName ) );

			#if( ipconfigUSE_IPv6 != 0 )
			{
				pxResult->ai_addr = ipPOINTER_CAST( struct freertos_sockaddr *, &( pxResult->xPrivateStorage.sockaddr6 ) );
			}
			#else
			{
				pxResult->ai_addr = &( pxResult->xPrivateStorage.sockaddr4 );
			}
			#endif
	
		#if( ipconfigUSE_IPv6 != 0 )
			memset( xAddress_IPv6.ucBytes, '\0', sizeof( xAddress_IPv6.ucBytes ) );
			if( xIPVersion == 6 )
			{
				FreeRTOS_dnslookup6( pcHost, &( xAddress_IPv6 ) );
				FreeRTOS_printf( ( "Lookup6 '%s' = %pip\n", pcHost, xAddress_IPv6.ucBytes ) );
				pxResult->ai_family =  FREERTOS_AF_INET6;
				pxResult->ai_addrlen = ipSIZE_OF_IPv6_ADDRESS;
				memcpy( pxResult->xPrivateStorage.sockaddr6.sin_addrv6.ucBytes, xAddress_IPv6.ucBytes, ipSIZE_OF_IPv6_ADDRESS );
			}
			else
		#endif /* ( ipconfigUSE_IPv6 != 0 ) */
			{
				ulIpAddress = FreeRTOS_dnslookup( pcHost );
				FreeRTOS_printf( ( "Lookup4 '%s' = %lxip\n", pcHost, FreeRTOS_ntohl( ulIpAddress ) ) );
				pxResult->ai_addr->sin_addr = ulIpAddress;
				pxResult->ai_family =  FREERTOS_AF_INET4;
				pxResult->ai_addrlen = ipSIZE_OF_IPv4_ADDRESS;
			}
		}
	}
#endif
#if( ipconfigMULTI_INTERFACE != 0 )
	/* Don't forget to call FreeRTOS_freeaddrinfo() */
	return pxResult;
#else
	return 0;
#endif
}

//const char *FreeRTOS_strerror_r( BaseType_t xErrnum, char *pcBuffer, size_t uxLength )
//{
//const char *pcName;
//
//	switch( xErrnum )
//	{
//		case pdFREERTOS_ERRNO_EADDRINUSE:     pcName = "EADDRINUSE"; break;
//		case pdFREERTOS_ERRNO_ENOMEM:         pcName = "ENOMEM"; break;
//		case pdFREERTOS_ERRNO_EADDRNOTAVAIL:  pcName = "EADDRNOTAVAIL"; break;
//		case pdFREERTOS_ERRNO_ENOPROTOOPT:    pcName = "ENOPROTOOPT"; break;
//		case pdFREERTOS_ERRNO_EBADF:          pcName = "EBADF"; break;
//		case pdFREERTOS_ERRNO_ENOSPC:         pcName = "ENOSPC"; break;
//		case pdFREERTOS_ERRNO_ECANCELED:      pcName = "ECANCELED"; break;
//		case pdFREERTOS_ERRNO_ENOTCONN:       pcName = "ENOTCONN"; break;
//		case pdFREERTOS_ERRNO_EINPROGRESS:    pcName = "EINPROGRESS"; break;
//		case pdFREERTOS_ERRNO_EOPNOTSUPP:     pcName = "EOPNOTSUPP"; break;
//		case pdFREERTOS_ERRNO_EINTR:          pcName = "EINTR"; break;
//		case pdFREERTOS_ERRNO_ETIMEDOUT:      pcName = "ETIMEDOUT"; break;
//		case pdFREERTOS_ERRNO_EINVAL:         pcName = "EINVAL"; break;
//		case pdFREERTOS_ERRNO_EWOULDBLOCK:    pcName = "EWOULDBLOCK"; break; /* same as EAGAIN */
//		case pdFREERTOS_ERRNO_EISCONN:        pcName = "EISCONN"; break;
//		default:
//			( void ) snprintf( pcBuffer, uxLength, "Errno %d", ( int ) xErrnum );	/*lint !e586 function 'snprintf' is deprecated. [MISRA 2012 Rule 21.6, required]. */
//			pcName = NULL;
//			break;
//	}
//	if( pcName != NULL )
//	{
//		( void ) snprintf( pcBuffer, uxLength, "%s", pcName );	/*lint !e586*/
//	}
//	if( uxLength > 0 )
//	{
//		pcBuffer[ uxLength - 1 ] = '\0';
//	}
//
//	return pcBuffer;
//}
/*-----------------------------------------------------------*/

//BaseType_t xCheckLoopback( NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t bReleaseAfterSend )
//{
//BaseType_t xResult = pdFALSE;
//NetworkBufferDescriptor_t * pxUseDescriptor = pxDescriptor;
//IPPacket_t *pxIPPacket = ( IPPacket_t * ) pxUseDescriptor->pucEthernetBuffer;
//
//	/* This function will check if the target IP-address belongs to this device.
//	 * If so, the packet will be passed to the IP-stack, who will answer it.
//	 * The function is to be called within the function xNetworkInterfaceOutput().
//	 */
//
//	if( ( pxIPPacket->xEthernetHeader.usFrameType == ipIPv4_FRAME_TYPE ) &&
//		( memcmp( pxIPPacket->xEthernetHeader.xDestinationAddress.ucBytes, ipLOCAL_MAC_ADDRESS, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 ) )
//	{
//		xResult = pdTRUE;
//		if( bReleaseAfterSend == pdFALSE )
//		{
//			/* Driver is not allowed to transfer the ownership
//			of descriptor,  so make a copy of it */
//			pxUseDescriptor =
//				pxDuplicateNetworkBufferWithDescriptor( pxDescriptor, pxDescriptor->xDataLength );
//		}
//		if( pxUseDescriptor != NULL )
//		{
//		IPStackEvent_t xRxEvent;
//
//			xRxEvent.eEventType = eNetworkRxEvent;
//			xRxEvent.pvData = ( void * ) pxUseDescriptor;
//			if( xSendEventStructToIPTask( &xRxEvent, 0u ) != pdTRUE )
//			{
//				vReleaseNetworkBufferAndDescriptor( pxUseDescriptor );
//				iptraceETHERNET_RX_EVENT_LOST();
//				FreeRTOS_printf( ( "prvEMACRxPoll: Can not queue return packet!\n" ) );
//			}
//			
//		}
//	}
//	return xResult;
//}
/*-----------------------------------------------------------*/

static void vRegisterDelay()
{
uint32_t uxCount;
	/*
	 * Regarding the HAL delay functions, I noticed that HAL delay is being used to workaround the
	 * "Successive write operations to the same register might not be fully taken into account" errata.
	 * The workaround requires a delay of four TX_CLK/RX_CLK clock cycles. For a 10 Mbit connection,
	 * these clocks are running at 2.5 MHz, so this delay would be 1.6 microseconds.
	 */
	uint64_t ullStart = ullGetHighResolutionTime();
	#define CPU_MAX_FREQ	SystemCoreClock
	#define WAIT_TIME_NS	10000uL
	const uint32_t NOP_COUNT = ( WAIT_TIME_NS * 10uL ) / ( 10000000000uL / CPU_MAX_FREQ );
	for( uxCount = NOP_COUNT; uxCount > 0uL; uxCount-- )
	{
		__NOP();
	}
	uint64_t ullStop = ullGetHighResolutionTime();
	uint32_t diff = ( uint32_t ) ( ullStop - ullStart );
	FreeRTOS_printf( ( "Time elapsed %lu\n", diff ) );
}

