htibosch/freertos_plus_projects/plus/stm32F40/Src/main.c
#if 0
#if( ipconfigMULTI_INTERFACE == 0 )

const char *FreeRTOS_strerror_r( BaseType_t xErrnum, char *pcBuffer, size_t uxLength )
{
const char *pcName;

	switch( xErrnum )
	{
		case pdFREERTOS_ERRNO_EADDRINUSE:     pcName = "EADDRINUSE"; break;
		case pdFREERTOS_ERRNO_ENOMEM:         pcName = "ENOMEM"; break;
		case pdFREERTOS_ERRNO_EADDRNOTAVAIL:  pcName = "EADDRNOTAVAIL"; break;
		case pdFREERTOS_ERRNO_ENOPROTOOPT:    pcName = "ENOPROTOOPT"; break;
		case pdFREERTOS_ERRNO_EBADF:          pcName = "EBADF"; break;
		case pdFREERTOS_ERRNO_ENOSPC:         pcName = "ENOSPC"; break;
		case pdFREERTOS_ERRNO_ECANCELED:      pcName = "ECANCELED"; break;
		case pdFREERTOS_ERRNO_ENOTCONN:       pcName = "ENOTCONN"; break;
		case pdFREERTOS_ERRNO_EINPROGRESS:    pcName = "EINPROGRESS"; break;
		case pdFREERTOS_ERRNO_EOPNOTSUPP:     pcName = "EOPNOTSUPP"; break;
		case pdFREERTOS_ERRNO_EINTR:          pcName = "EINTR"; break;
		case pdFREERTOS_ERRNO_ETIMEDOUT:      pcName = "ETIMEDOUT"; break;
		case pdFREERTOS_ERRNO_EINVAL:         pcName = "EINVAL"; break;
		case pdFREERTOS_ERRNO_EWOULDBLOCK:    pcName = "EWOULDBLOCK"; break; /* same as EAGAIN */
		case pdFREERTOS_ERRNO_EISCONN:        pcName = "EISCONN"; break;
		default:
			( void ) snprintf( pcBuffer, uxLength, "Errno %d", ( int ) xErrnum );	/*lint !e586 function 'snprintf' is deprecated. [MISRA 2012 Rule 21.6, required]. */
			pcName = NULL;
			break;
	}
	if( pcName != NULL )
	{
		( void ) snprintf( pcBuffer, uxLength, "%s", pcName );	/*lint !e586*/
	}
	if( uxLength > 0 )
	{
		pcBuffer[ uxLength - 1 ] = '\0';
	}

	return pcBuffer;
}
#endif	/* ( ipconfigMULTI_INTERFACE == 0 ) */
/*-----------------------------------------------------------*/

#endif  /* 0 */

#if 0
BaseType_t xCheckLoopback( NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t bReleaseAfterSend )
{
BaseType_t xResult = pdFALSE;
NetworkBufferDescriptor_t * pxUseDescriptor = pxDescriptor;
IPPacket_t *pxIPPacket = ( IPPacket_t * ) pxUseDescriptor->pucEthernetBuffer;

	/* This function will check if the target IP-address belongs to this device.
	 * If so, the packet will be passed to the IP-stack, who will answer it.
	 * The function is to be called within the function xNetworkInterfaceOutput().
	 */

	if( ( pxIPPacket->xEthernetHeader.usFrameType == ipIPv4_FRAME_TYPE ) &&
		( memcmp( pxIPPacket->xEthernetHeader.xDestinationAddress.ucBytes, ipLOCAL_MAC_ADDRESS, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 ) )
	{
		xResult = pdTRUE;
		if( bReleaseAfterSend == pdFALSE )
		{
			/* Driver is not allowed to transfer the ownership
			of descriptor,  so make a copy of it */
			pxUseDescriptor =
				pxDuplicateNetworkBufferWithDescriptor( pxDescriptor, pxDescriptor->xDataLength );
		}
		if( pxUseDescriptor != NULL )
		{
		IPStackEvent_t xRxEvent;

			xRxEvent.eEventType = eNetworkRxEvent;
			xRxEvent.pvData = ( void * ) pxUseDescriptor;
			if( xSendEventStructToIPTask( &xRxEvent, 0u ) != pdTRUE )
			{
				vReleaseNetworkBufferAndDescriptor( pxUseDescriptor );
				iptraceETHERNET_RX_EVENT_LOST();
				FreeRTOS_printf( ( "prvEMACRxPoll: Can not queue return packet!\n" ) );
			}
			
		}
	}
	return xResult;
}
/*-----------------------------------------------------------*/
#endif	/* ( ipconfigMULTI_INTERFACE == 0 ) */

static void vUDPTest( void *pvParameters )
{
Socket_t xUDPSocket;
struct freertos_sockaddr xAddress;
char pcBuffer[ 128 ];
const TickType_t x1000ms = 1000UL / portTICK_PERIOD_MS;
int port_number = 30718;
socklen_t xAddressLength;

	( void ) pvParameters;

	/* Create the socket. */
	xUDPSocket = FreeRTOS_socket( FREERTOS_AF_INET,
										FREERTOS_SOCK_DGRAM,/*FREERTOS_SOCK_DGRAM for UDP.*/
										FREERTOS_IPPROTO_UDP );

	/* Check the socket was created. */
	configASSERT( xUDPSocket != FREERTOS_INVALID_SOCKET );

	xAddress.sin_addr = FreeRTOS_GetIPAddress();
	xAddress.sin_port = FreeRTOS_htons( port_number );
	FreeRTOS_bind( xUDPSocket, &xAddress, sizeof xAddressLength );

	FreeRTOS_setsockopt( xUDPSocket, 0, FREERTOS_SO_RCVTIMEO, &x1000ms, sizeof( x1000ms ) );

	#if( ipconfigUSE_CALLBACKS != 0 )
	{
		F_TCP_UDP_Handler_t xHandler;
		memset( &xHandler, '\0', sizeof ( xHandler ) );
		xHandler.pOnUdpReceive = xOnUdpReceive;
		FreeRTOS_setsockopt( xUDPSocket, 0, FREERTOS_SO_UDP_RECV_HANDLER, ( void * ) &xHandler, sizeof( xHandler ) );
	}
	#endif

	for( ;; )
	{
	int rc;
	socklen_t len = sizeof xAddress;
		rc = FreeRTOS_recvfrom( xUDPSocket, pcBuffer, sizeof pcBuffer, 0, &xAddress,  &len );
		if (rc > 0) {
			uint8_t *pucBuffer = ( uint8_t * ) pcBuffer;
			FreeRTOS_printf( ( "Received from %d: %d bytes: %02x %02x %02x %02x\n", FreeRTOS_htons(xAddress.sin_port), rc,
						pucBuffer[ 0 ],
						pucBuffer[ 1 ],
						pucBuffer[ 2 ],
						pucBuffer[ 3 ] ) );
		}
	}
}

uint32_t get_time( void )
{
	return ( uint32_t ) time( NULL );
}

